[
  {
    "id": 1,
    "問題文": "AI（人工知能）に関する説明として、最も適切なものはどれか。",
    "選択肢a": "人間の脳と全く同じ構造を持つ電子回路のことである。",
    "選択肢b": "必ず物理的な機械（ロボット）の形で存在する。",
    "選択肢c": "物理的な実体を持たず、ソフトウェアやアプリケーションの形で存在する。",
    "選択肢d": "知能は持たず、決められた動作を正確に繰り返すプログラムのことである。",
    "正解": "c",
    "解説": "AIは、人間の知的な活動を模倣する概念や技術の総称であり、特定の物理的な形を持つとは限りません。多くはソフトウェアやアプリケーションとして、スマートフォン、コンピュータ、サーバーなどで動作します。\naは、AIの研究には、人間の脳の仕組みを参考にしたニューラルネットワークなどがありますが、現在の技術では脳と全く同じ構造を再現できているわけではありません。\nbは、ロボットのように物理的な形を持つAIもありますが、それはAIの応用例の一つにすぎません。AI自体は必ずしも物理的な実体を必要としません。\ndは、決められた動作を繰り返すだけのプログラムは、AIとは区別されます。AIはデータから学習し、状況に応じて判断や予測を行う能力を持ちます。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 2,
    "問題文": "AI研究が始まった歴史的背景として、関連の深い出来事はどれか。",
    "選択肢a": "インターネットの商用利用開始",
    "選択肢b": "第二次世界大戦と計算機の発展",
    "選択肢c": "活版印刷技術の発明",
    "選択肢d": "産業革命と蒸気機関の発明",
    "正解": "b",
    "解説": "AIの研究は、暗号解読などの軍事的な要請があった第二次世界大戦や、それに伴う電子計算機（コンピュータ）の発展を大きな背景として、1950年代に本格的に始まりました。\naは、インターネットの普及は、AI、特に機械学習の発展を大きく加速させる要因となりましたが、AI研究の「始まり」はそれよりずっと前です。\ncは、活版印刷は情報の複製と伝達に革命をもたらしましたが、知能を機械で再現しようとするAIの思想とは直接関係ありません。\ndは、産業革命は機械化の時代であり、現代のAIにつながる情報処理や計算の概念とは直接的な関係は薄いです。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 3,
    "問題文": "AIの進化に伴う社会的な懸念として、挙げられていないものはどれか。",
    "選択肢a": "個人データのプライバシー侵害",
    "選択肢b": "人間の仕事が奪われる可能性",
    "選択肢c": "AIによる判断の倫理的な問題",
    "選択肢d": "エネルギー消費量の飛躍的な減少",
    "正解": "d",
    "解説": "AI、特に大規模なモデルの学習や運用には、膨大な計算能力と電力が必要です。そのため、AIの普及はエネルギー消費量の「増加」につながる懸念があり、「減少」するというのは誤りです。\naは、AIは大量のデータを学習に利用するため、個人データが不適切に収集・利用され、プライバシーが侵害されるリスクが懸念されています。\nbは、AIによる自動化が進むことで、特定の職種がAIに代替され、人間の雇用が失われる可能性が指摘されています。\ncは、自動運転車の事故時の判断や、採用活動におけるAIのバイアス（偏見）など、AIの判断が倫理的に許容されるかどうかが重要な問題となっています。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 4,
    "問題文": "AIに知能をもたらす仕組みを大きく分類したとき、適切な組み合わせはどれか。",
    "選択肢a": "ルールベースと機械学習",
    "選択肢b": "深層学習と強化学習",
    "選択肢c": "ハードウェアとソフトウェア",
    "選択肢d": "教師あり学習と教師なし学習",
    "正解": "a",
    "解説": "AIを実現するためのアプローチは、人間が設定したルールに従って動作する「ルールベース」と、コンピュータ自身がデータから学習する「機械学習」の2つに大別されます。\nbは、深層学習（ディープラーニング）は機械学習の一分野であり、強化学習も機械学習の手法の一つです。これらは同列の大きな分類ではありません。\ncは、これらはコンピュータシステムを構成する要素であり、AIの仕組みの分類ではありません。\ndは、これらは両方とも「機械学習」の中に含まれる手法の分類です。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 5,
    "問題文": "ルールベースAIに関する説明として、最も適切なものはどれか。",
    "選択肢a": "明確なルールがない曖昧な問題（画像認識など）の解決を得意とする。",
    "選択肢b": "コンピュータ自身がデータからパターンを見つけ出し、ルールを自動で生成する。",
    "選択肢c": "専門家の知識や経験を「もしAならばB」という形式のルールとして大量にプログラムする必要がある。",
    "選択肢d": "大量のルールをプログラムする必要がないため、開発やメンテナンスのコストを節約できる。",
    "正解": "c",
    "解説": "ルールベースAIは、人間が事前に定義した膨大なルール群に基づいて判断を行います。そのため、開発やメンテナンスには多くの時間とコストがかかるという特徴があります。\naは、ルールベースAIは、ルールを明確に定義できる問題（例：簡単な診断システム）は得意ですが、ルール化が難しい曖昧な問題は苦手とします。\nbは、データからパターンを自動で見つけ出すのは、機械学習のアプローチです。\ndは、これはルールベースAIの特徴とは逆の説明です。ルールを一つ一つ人間が記述・修正する必要があるため、時間とコストがかかります。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 6,
    "問題文": "機械学習のアプローチに関する説明として、最も適切なものはどれか。",
    "選択肢a": "人間が事前に定義したルールに従い、入力された情報に対して忠実に判断を出力する。",
    "選択肢b": "学習プロセスが不要で、導入後すぐにタスクを実行できる。",
    "選択肢c": "常に100%の精度で正解を出力することが保証されている。",
    "選択肢d": "コンピュータ自身がデータから特徴やパターンを学習し、それに基づいて予測や判断を行う。",
    "正解": "d",
    "解説": "機械学習は、データ駆動型のアプローチであり、与えられたデータからコンピュータが自律的に法則性やパターンを学び、未知のデータに対する予測や分類を行います。\naは、これはルールベースAIの説明です。機械学習はルールを人間が与えるのではなく、データから見つけ出します。\nbは、機械学習は、その名の通り「学習」のプロセスが不可欠です。大量のデータを使ってモデルをトレーニングする時間が必要です。\ncは、機械学習モデルの性能はデータの質や量に依存し、常に100%の精度を保証するものではありません。予測には誤りが含まれる可能性があります。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 7,
    "問題文": "教師あり学習に関する説明として、最も適切なものはどれか。",
    "選択肢a": "正解データを与えず、データそのものの構造やパターンをコンピュータ自身に見つけさせる。",
    "選択肢b": "入力データと、それに対応する正解データ（ラベル）をペアで与え、モデルをトレーニングする。",
    "選択肢c": "学習に一切データを使わず、論理的な推論のみで答えを導き出す。",
    "選択肢d": "試行錯誤を通じて、報酬が最も大きくなるような行動を学習していく。",
    "正解": "b",
    "解説": "教師あり学習は、問題（入力データ）とその答え（正解データ）のセットを「教師」としてモデルに与え、その関係性を学習させる手法です。\naは、「教師なし学習」の説明です。データのクラスタリング（グループ分け）などに用いられます。\ncは、AIの古典的なアプローチ（記号主義AI）に近い考え方であり、データ駆動型の機械学習とは異なります。\ndは、「強化学習」の説明です。AIエージェントが環境内で行動し、その結果得られる報酬を最大化するように学習します。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 8,
    "問題文": "機械学習における「次元削減」とは、どのような操作か。",
    "選択肢a": "データの特徴をできるだけ維持しながら、データの変数（次元）を減らすこと。",
    "選択肢b": "3次元のデータを2次元のグラフにプロットして可視化すること。",
    "選択肢c": "モデルの予測精度を上げるために、学習データの量を増やすこと。",
    "選択肢d": "モデルの計算速度を上げるために、コンピュータの性能を下げること。",
    "正解": "a",
    "解説": "次元削減は、多くの変数（特徴量）を持つデータから、本質的な情報を持つ少数の変数に要約する技術です。これにより、計算コストの削減やモデルの性能向上、過学習の抑制などの効果が期待できます。\nbは、データの可視化は次元削減の結果として行われることもありますが、次元削減そのものの定義ではありません。\ncは、学習データを増やすことは「データ拡張（Data Augmentation）」などと呼ばれ、次元削減とは異なる操作です。\ndは、モデルの計算速度を上げる目的は正しいですが、その手段としてコンピュータの性能を下げるのは本末転倒です。次元削減は、データを効率的に扱うための手法です。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 9,
    "問題文": "強化学習の応用例として、最も適切なものはどれか。",
    "選択肢a": "迷惑メールフィルタ、株価予測、画像診断",
    "選択肢b": "天気予報、機械翻訳、音声認識",
    "選択肢c": "自動運転車、ゲームAI、ロボット制御",
    "選択肢d": "顧客のグループ分け、異常検知、レコメンデーション",
    "正解": "c",
    "解説": "自動運転車、ゲームAI、ロボット制御はすべて、ある「環境」の中で試行錯誤を繰り返し、最適な「行動」を見つけ出すという強化学習の考え方が応用されている代表的な分野です。\naやbは、過去のデータから未来を予測したり、データを分類したりするタスクであり、主に「教師あり学習」が用いられます。\ndは、データ内の構造やパターンを見つけ出すタスクであり、主に「教師なし学習」が用いられます。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 10,
    "問題文": "「ノーフリーランチ定理」が示唆する内容として、最も適切なものはどれか。",
    "選択肢a": "十分な計算資源があれば、どんな問題でも解決できる万能なアルゴリズムを作ることができる。",
    "選択肢b": "あらゆる問題に対して常に最高の性能を発揮する、万能なアルゴリズムは存在しない。",
    "選択肢c": "機械学習モデルの性能は、昼食休憩を取るかどうかで変化する。",
    "選択肢d": "無料で利用できる機械学習アルゴリズムは、性能が低い。",
    "正解": "b",
    "解説": "ノーフリーランチ定理は、「うまい話はない」という比喩で、ある問題で高い性能を発揮するアルゴリズムが、別の問題でも同様に高い性能を発揮するとは限らないことを数学的に示したものです。つまり、解きたい問題に合わせて適切なアルゴリズムを選択する必要があることを意味します。\naは、ノーフリーランチ定理とは全く逆の主張です。\ncは、名前に「ランチ」とありますが、食事や休憩とは全く関係のない、純粋に数学的な定理です。\ndは、この定理は、アルゴリズムの理論的な限界について述べたものであり、ソフトウェアの価格やライセンスとは関係ありません。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 11,
    "問題文": "ニューラルネットワークにおいて、入力された情報の重要度を調整する役割を担うものは何か。",
    "選択肢a": "ノード（Node）",
    "選択肢b": "層（Layer）",
    "選択肢c": "活性化関数（Activation Function）",
    "選択肢d": "重み（Weight）",
    "正解": "d",
    "解説": "「重み」は、ニューラルネットワークのノード間の接続の強さを示すパラメータです。この重みの値を調整（重み付け）することで、どの入力情報を重要視し、どの情報を軽視するかを学習していきます。これは、人間の脳のシナプスの結合強度に相当します。\naは、ノードは、情報を受け取って処理する、神経細胞に相当する基本的な単位ですが、重要度を調整する役割そのものではありません。\nbは、層は、ノードが集まってできた階層構造のことです。\ncは、活性化関数は、ノードが受け取った信号を次の層にどのように出力するかを決定するための関数で、情報の重要度調整とは役割が異なります。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 12,
    "問題文": "機械学習モデルが訓練データに過剰に適合してしまい、未知のデータに対する予測性能が低下する「過学習」。その回避方法として、適切でないものはどれか。",
    "選択肢a": "学習率（Learning Rate）を極端に大きくする。",
    "選択肢b": "正則化（Regularization）",
    "選択肢c": "ドロップアウト（Dropout）",
    "選択肢d": "アーリーストッピング（早期終了）",
    "正解": "a",
    "解説": "学習率を極端に大きくすると、学習が不安定になったり、最適解を通り過ぎて発散してしまったりする原因となり、過学習の対策にはなりません。むしろ適切な値に調整することが重要です。\nbは、正則化は、モデルのパラメータが大きくなりすぎるのを防ぎ、モデルが複雑になりすぎるのを抑制する手法で、過学習の代表的な回避策です。\ncは、ドロップアウトは、学習中にニューロンをランダムに無効化することで、モデルが特定のデータに依存しすぎるのを防ぐ手法で、特にニューラルネットワークにおける有効な過学習の回避策です。\ndは、アーリーストッピングは、検証用データの性能が悪化し始めた時点で学習を打ち切る手法で、過学習の有効な回避策です。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 13,
    "問題文": "過学習の回避策である「ドロップアウト」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "モデルのパラメータの大きさにペナルティを課し、モデルの複雑さを制限する。",
    "選択肢b": "訓練データを複数に分割し、異なるモデルを学習させて結果を統合する。",
    "選択肢c": "学習時にニューラルネットワークの一部のニューロンをランダムに無効化する。",
    "選択肢d": "検証用データに対する性能を監視し、性能が悪化したら学習を停止する。",
    "正解": "c",
    "解説": "ドロップアウトは、学習のたびにランダムに一部のニューロンを「ドロップアウト（脱落）」させることで、ネットワークが特定の特徴に過度に依存するのを防ぎ、より汎化性能の高いモデルを作る手法です。\naは、「正則化」の説明です。\nbは、「アンサンブル学習」（例：バギング、ブースティング）の説明です。これも過学習の抑制に有効な手法ですが、ドロップアウトとは異なります。\ndは、「アーリーストッピング（早期終了）」の説明です。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 14,
    "問題文": "AIの能力を分類した「AIの4つのレベル」において、自らデータからパターンを見出し、それに基づいて出力を調整する「機械学習を利用したAI」はどのレベルに該当するか。",
    "選択肢a": "レベル2",
    "選択肢b": "レベル3",
    "選択肢c": "レベル4",
    "選択肢d": "レベル1",
    "正解": "b",
    "解説": "レベルcは、機械学習を実装したAIを指します。検索エンジンやレコメンデーションシステムのように、データからパターンを学習し、予測や判断を行うものがこれに該当します。\naは、レベルbは、古典的なAI（ルールベースAI）で、探索や推論など、より複雑なルールに基づいて動作するものです。チェスAIなどが例です。\ncは、レベルdは、深層学習（ディープラーニング）を実装したAIを指します。自ら特徴量を発見し、画像認識や音声認識などで高い性能を発揮します。\ndは、レベルaは、単純な制御プログラムで、エアコンの温度調整のように、あらかじめ決められたルールに従って動くものです。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 15,
    "問題文": "AIが人間の知能を総合的に超越する技術的転換点、またはその時点を指す言葉は何か。",
    "選択肢a": "過学習（オーバーフィッティング）",
    "選択肢b": "汎用人工知能（AGI）",
    "選択肢c": "ノーフリーランチ定理",
    "選択肢d": "シンギュラリティ（技術的特異点）",
    "正解": "d",
    "解説": "シンギュラリティは、AIが自己進化を始め、その知能が爆発的に向上し、人類の知能を凌駕する未来の時点を指す概念です。これにより、人間の生活や社会が根本的に変容すると予測されています（2045年問題など）。\naは、過学習は、機械学習における一技術的な課題であり、AIが人間を超える概念とは異なります。\nbは、汎用人工知能（AGI）は、特定のタスクだけでなく、人間のように様々な知的作業をこなせるAIの「種類」を指す言葉です。シンギュラリティはAGIの実現によって到来する可能性が指摘されていますが、シンギュラリティそのものを指す言葉ではありません。\ncは、ノーフリーランチ定理は、万能なアルゴリズムは存在しないという理論であり、シンギュラリティの概念とは直接関係ありません。",
    "ジャンル": "AIの概要"
  },
  {
    "id": 16,
    "問題文": "ボルツマンマシンに関する説明として、最も適切なものはどれか。",
    "選択肢a": "2006年にヤン・ルカンによって提唱された、CNNの基礎となるモデルである。",
    "選択肢b": "1980年代後半に、ジェフリー・ヒントンとテリー・セジュノスキーらによって提唱された。",
    "選択肢c": "1990年代に、ボルツマンマシンを改良して制限付きボルツマンマシンが生まれた。",
    "選択肢d": "主に強化学習の分野で利用される、状態価値を計算するためのアルゴリズムである。",
    "正解": "b",
    "解説": "ボルツマンマシンは、1980年代後半にジェフリー・ヒントンとテリー・セジュノスキーが率いる研究グループによって提唱されたニューラルネットワークの一種です。\naは、CNNの基礎は1980年代にヤン・ルカンらによって開発されたLeNetなどに関連しますが、ボルツマンマシンとは直接の関係はありません。\ncは、時系列が逆です。ボルツマンマシンを改良するために制限付きボルツマンマシンが開発されました。\ndは、強化学習のアルゴリズム（例：Q学習など）の説明であり、ボルツマンマシンとは異なります。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 17,
    "問題文": "ボルツマンマシンと制限付きボルツマンマシン（RBM）の関係について、最も適切なものはどれか。",
    "選択肢a": "これら2つのモデルは、全く異なる目的のために、別々の研究者によって開発された。",
    "選択肢b": "ボルツマンマシンの処理時間などの課題を改善するために、制限付きボルツマンマシンが開発された。",
    "選択肢c": "制限付きボルツマンマシンを多層に重ねることで、ボルツマンマシンが生まれた。",
    "選択肢d": "ボルツマンマシンと制限付きボルツマンマシンは、同じ構造を持つモデルの別名である。",
    "正解": "b",
    "解説": "ボルツマンマシンは学習に膨大な時間がかかるという課題があり、それを改善するために、ニューロン間の接続を制限した制限付きボルツマンマシン（RBM）が1986年に開発されました。\naは、RBMはボルツマンマシンの直接的な改良版であり、関連性が非常に深いです。\ncは、関係が逆です。ボルツマンマシンが先にあり、それを改良したのがRBMです。\ndは、両者はニューロン間の接続に違いがあり、異なる構造を持つモデルです。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 18,
    "問題文": "制限付きボルツマンマシン（RBM）の構造的な特徴として、最も適切なものはどれか。",
    "選択肢a": "全ての人工ニューロンが相互に接続されており、自由な情報の流れを許容している。",
    "選択肢b": "主に画像認識に用いられ、畳み込み層とプーリング層で構成されている。",
    "選択肢c": "過去の情報を記憶するための再帰的な接続（ループ構造）を持っている。",
    "選択肢d": "ニューロン間の接続に制限があり、データ処理を入力部分と推定部分の2つに分けている。",
    "正解": "d",
    "解説": "制限付きボルツマンマシンは、ボルツマンマシンとは異なり、ニューロン間の接続を特定のルール（同じ層内では接続しないなど）に基づいて制限し、ネットワークを入力層と隠れ層（推定部分）の2つの部分に分けることで、計算を効率化しています。\naは、ボルツマンマシンの特徴です。RBMでは接続が制限されます。\nbは、CNN（畳み込みニューラルネットワーク）の特徴です。\ncは、RNN（回帰型ニューラルネットワーク）の特徴です。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 19,
    "問題文": "制限付きボルツマンマシン（RBM）の学習方法について、最も適切なものはどれか。",
    "選択肢a": "教師あり学習と教師なし学習の両方を実行することが可能である。",
    "選択肢b": "教師あり学習はできるが、教師なし学習をすることはできない。",
    "選択肢c": "行動と報酬を元に学習する強化学習のみに特化している。",
    "選択肢d": "教師なし学習はできるが、教師あり学習をすることはできない。",
    "正解": "a",
    "解説": "制限付きボルツマンマシンは、データの特徴を抽出するなどのタスクで教師なし学習に用いられることが多いですが、分類問題などの教師あり学習にも応用することが可能です。\nb、c、dは、RBMの能力を限定的にしか述べておらず、誤りです。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 20,
    "問題文": "自己回帰モデル（ARモデル）に関する説明として、最も適切なものはどれか。",
    "選択肢a": "データのグループ分け（クラスタリング）を行うための、代表的な教師なし学習モデルである。",
    "選択肢b": "あるデータ自身の過去のデータを用いて、将来のデータを予測するモデルである。",
    "選択肢c": "画像データから物体の位置や種類を特定するために用いられるモデルである。",
    "選択肢d": "生成器と識別器が競い合うことで、本物に近いデータを生成するモデルである。",
    "正解": "b",
    "解説": "自己回帰モデルは、過去の自身の値が将来の自身の値に影響するという考えに基づいています。株価や天気など、時間の経過と共に変化する時系列データの予測に特に効果的です。\naは、k-means法などのクラスタリング手法の説明です。\ncは、CNNなどの画像認識モデルの説明です。\ndは、GAN（敵対的生成ネットワーク）の説明です。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 21,
    "問題文": "ディープラーニング（深層学習）に関する説明として、最も適切なものはどれか。",
    "選択肢a": "人間が事前に定義したルールに基づいて、論理的な推論を行う技術である。",
    "選択肢b": "多層のニューラルネットワークを用いて、データから複雑なパターンを自動で学習する技術である。",
    "選択肢c": "学習に必要なデータ量が少なく、計算コストも非常に低いという利点がある。",
    "選択肢d": "主に単純な線形関係しかモデル化することができない。",
    "正解": "b",
    "解説": "ディープラーニングは、人間の脳の神経回路網を模したニューラルネットワークを深く（多層に）重ねることで、データに潜む高度で複雑な特徴量を自動で抽出し、学習する能力を持ちます。\naは、ルールベースAIの説明です。\ncは、逆の説明です。一般的にディープラーニングは大量のデータと高い計算コストを必要とします。\ndは、逆の説明です。ディープラーニングは複雑な非線形関係をモデル化することを得意とします。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 22,
    "問題文": "CNN（畳み込みニューラルネットワーク）が画像の特徴を抽出する仕組みとして、最も適切なものはどれか。",
    "選択肢a": "画像全体のピクセル値を一度に平均し、その平均値から特徴を判断する。",
    "選択肢b": "まず局所的な特徴（エッジやコーナーなど）を抽出し、層を重ねるごとにより全体的な特徴を捉える。",
    "選択肢c": "画像のピクセルを時系列データとみなし、順番に処理することで特徴を抽出する。",
    "選択肢d": "画像の局所的な特徴は捉えられるが、全体的な特徴を抽出することはできない。",
    "正解": "b",
    "解説": "CNNは、フィルター（カーネル）を用いて画像の一部分（局所的な範囲）から特徴を抽出し、次の層ではその特徴をさらに組み合わせて、より大域的で複雑な特徴（部品から物体全体へ、など）を抽出していきます。\naは、単純な処理であり、CNNの高度な特徴抽出の仕組みとは異なります。\ncは、RNNなどがシーケンスデータを扱う方法であり、CNNの仕組みとは異なります。\ndは、CNNの能力を誤って低く評価しています。局所的な特徴から全体的な特徴を捉えることこそがCNNの強みです。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 23,
    "問題文": "VAE（変分オートエンコーダ）を構成するエンコーダの役割として、最も適切なものはどれか。",
    "選択肢a": "入力データを、その特徴を捉えた低次元の潜在ベクトルに変換する。",
    "選択肢b": "潜在ベクトルから、元の入力データに近いデータを生成（復元）する。",
    "選択肢c": "入力データが本物か、AIが生成した偽物かを判別する。",
    "選択肢d": "入力データに含まれるノイズを除去し、画像を鮮明にする。",
    "正解": "a",
    "解説": "VAEはエンコーダとデコーダから構成されます。エンコーダは、高次元の入力データ（例：画像）を受け取り、そのデータの本質的な特徴を保持したまま、より低次元の表現（潜在ベクトル）に圧縮する役割を担います。\nbは、デコーダの役割です。\ncは、GANにおける識別器の役割です。\ndは、ノイズ除去はVAEの応用の一つですが、エンコーダの基本的な役割そのものではありません。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 24,
    "問題文": "GAN（敵対的生成ネットワーク）の学習メカニズムとして、最も適切なものはどれか。",
    "選択肢a": "「エンコーダ」と「デコーダ」が協調し、データを圧縮・復元することで学習する。",
    "選択肢b": "大量の正解ラベル付きデータを用いて、入力と出力の関係を直接学習する。",
    "選択肢c": "「生成器」と「識別器」という2つのネットワークが互いに競い合うことで学習する。",
    "選択肢d": "エージェントが環境内で試行錯誤し、得られる報酬を最大化するように学習する。",
    "正解": "c",
    "解説": "GANは、本物そっくりのデータを生成しようとする「生成器（Generator）」と、そのデータが本物か生成されたものかを見抜こうとする「識別器（Discriminator）」が、互いに競い合い、能力を高め合うことで学習が進むというユニークな仕組みを持っています。\naは、オートエンコーダ（VAEなど）の仕組みです。\nbは、教師あり学習の一般的な仕組みです。\ndは、強化学習の仕組みです。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 25,
    "問題文": "RNN（回帰型ニューラルネットワーク）の基本的な特性として、最も適切なものはどれか。",
    "選択肢a": "入力データの順序に関係なく、すべての要素を一度に並列処理する。",
    "選択肢b": "過去の情報を内部の状態（隠れ状態）として記憶し、次の処理に利用する。",
    "選択肢c": "画像データ内の空間的な特徴を抽出することに特化している。",
    "選択肢d": "非常に長い時系列データでも、勾配消失問題を起こすことなく安定して学習できる。",
    "正解": "b",
    "解説": "RNNは、ネットワーク内にループ構造を持つことで、過去の情報を保持し続けることができます。これにより、文章や音声のような、順序が意味を持つシーケンスデータの処理を可能にしています。\naは、Transformerモデルの特徴です。\ncは、CNNの特徴です。\ndは、RNNの課題点を述べたものです。RNNは長いシーケンスを扱うと勾配消失・爆発問題が起こりやすく、これを解決するためにLSTMなどが考案されました。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 26,
    "問題文": "LSTM（Long Short-Term Memory）に関する説明として、最も適切なものはどれか。",
    "選択肢a": "RNNの課題であった勾配消失問題を軽減し、より長期の依存関係を学習できる。",
    "選択肢b": "構造が単純なため並列学習に適しており、大規模データの学習も高速に行える。",
    "選択肢c": "主に静止画像の分類タスクで高い性能を発揮するモデルである。",
    "選択肢d": "RNNとは異なり、過去の情報を一切記憶しない順伝播型のネットワークである。",
    "正解": "a",
    "解説": "LSTMは、RNNの内部に「ゲート」と呼ばれる仕組みを導入することで、情報の取捨選択を可能にし、長期的な情報の記憶を容易にしました。これにより、RNNが苦手としていた長いシーケンスデータの学習が可能になりました。\nbは、逆の説明です。LSTMは内部構造が複雑なため、RNNよりも計算コストが高く、並列学習には適していません。\ncは、CNNなどが得意とする領域です。\ndは、LSTMはRNNの一種であり、過去の情報を記憶する再帰的な構造を持っています。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 27,
    "問題文": "Transformerモデルの革新的な特徴として、最も適切なものはどれか。",
    "選択肢a": "RNNやLSTMと同様に、データを一つずつ順番に処理する再帰的な構造を持つ。",
    "選択肢b": "畳み込みとプーリングを繰り返すことで、階層的な特徴を抽出する。",
    "選択肢c": "自己注意機構（Self-Attention）により、データの順序に依存せず要素間の関連性を直接計算できる。",
    "選択肢d": "主にデータの次元削減や可視化のために使用される教師なし学習モデルである。",
    "正解": "c",
    "解説": "Transformerの最大の特徴は、自己注意機構です。これにより、シーケンス内の任意の2つの単語間の関連性の重みを計算できます。RNNのようにデータを順番に処理する必要がないため、大幅な並列化が可能となり、計算効率が飛躍的に向上しました。\naは、RNNやLSTMの特徴であり、Transformerが克服した点です。\nbは、CNNの特徴です。\ndは、主成分分析（PCA）などの説明であり、Transformerの主な用途とは異なります。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 28,
    "問題文": "BERTモデルが持つ「双方向性」とは、どのような特性か。",
    "選択肢a": "英語から日本語、日本語から英語というように、双方向に翻訳できる特性。",
    "選択肢b": "テキストだけでなく、音声も同時に入力として受け取れる特性。",
    "選択肢c": "ある単語の意味を理解する際に、その単語より前にある文脈のみを利用する特性。",
    "選択肢d": "ある単語の意味を理解する際に、その単語の前と後の両方の文脈を利用する特性。",
    "正解": "d",
    "解説": "BERT以前の言語モデルの多くは、文を一方向（左から右）にしか処理できませんでした。BERTは、文中の一部の単語を隠し（マスクし）、その単語を予測するというタスク（MLM）を通じて、隠された単語の前後両方の文脈から意味を学習することを可能にしました。\naは、翻訳モデルの機能ですが、「双方向性」が指す技術的な意味とは異なります。\nbは、マルチモーダル性の説明です。\ncは、一方向性のモデル（例：初期のGPT）の説明です。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 29,
    "問題文": "BERTの学習タスクの一つであるNSP（Next Sentence Prediction）とは、どのようなものか。",
    "選択肢a": "文中の単語を隠し、その単語が何かを予測するタスク。",
    "選択肢b": "与えられた2つの文が、文章中で連続しているかどうかを予測するタスク。",
    "選択肢c": "与えられた文の感情が、ポジティブかネガティブかを予測するタスク。",
    "選択肢d": "与えられた文を、別の言語に翻訳するタスク。",
    "正解": "b",
    "解説": "NSPは、BERTに2つの文を与え、それらが原文で隣り合っていたペアかどうかを二値分類させるタスクです。これにより、BERTは単語レベルだけでなく、文と文の間の関係性を理解する能力を獲得します。\naは、BERTのもう一つの学習タスクであるMLM（Masked Language Model）の説明です。\ncは、感情分析タスクの説明です。\ndは、機械翻訳タスクの説明です。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 30,
    "問題文": "BERTとRoBERTaの関係について、最も適切なものはどれか。",
    "選択肢a": "BERTは、2019年にFacebook AIがRoBERTaの改良モデルとして発表した。",
    "選択肢b": "RoBERTaとBERTは、同じアーキテクチャを持つが、開発した組織が異なるライバルモデルである。",
    "選択肢c": "RoBERTaは、2019年にFacebook AIがBERTを改良し、より大量のデータで訓練したモデルである。",
    "選択肢d": "BERTとRoBERTaは、画像認識の分野で性能を競うために開発されたモデルである。",
    "正解": "c",
    "解説": "RoBERTa（A Robustly Optimized BERT Pretraining Approach）は、BERTの学習方法を最適化し、訓練データ量を約10倍に増やすなどの改良を施したモデルで、多くの自然言語処理タスクでBERTを上回る性能を示しました。\naは、関係が逆です。RoBERTaがBERTの改良版です。\nbは、単なるライバルではなく、明確にBERTをベースとした改良モデルです。\ndは、両モデルともに自然言語処理のモデルであり、画像認識モデルではありません。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 31,
    "問題文": "ALBERTモデルに関する説明として、最も適切なものはどれか。",
    "選択肢a": "BERTよりもパラメータ数を増やし、性能を極限まで高めた大規模モデルである。",
    "選択肢b": "BERTを軽量化したモデルで、計算リソースが限られた環境でも高い性能を発揮する。",
    "選択肢c": "BERTのアーキテクチャを画像認識に応用するために開発されたモデルである。",
    "選択肢d": "計算リソースが限られた環境では、高いパフォーマンスを実現することができない。",
    "正解": "b",
    "解説": "ALBERT（A Lite BERT）は、パラメータ共有などの技術を用いてBERTのパラメータ数を大幅に削減し、軽量化と高速化を実現したモデルです。これにより、スマートフォンなどリソースが限られたデバイスでも動作させることが容易になりました。\naは、逆の説明です。ALBERTは軽量化を目指したモデルです。\ncは、ALBERTの目的とは異なります。\ndは、逆の説明です。リソースが限られた環境で高い性能を発揮できることがALBERTの強みです。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 32,
    "問題文": "2019年に発表されたGPT-2が、当初フルモデルの公開を控えた理由として、最も適切なものはどれか。",
    "選択肢a": "モデルの性能が低く、実用に耐えうると判断されなかったため。",
    "選択肢b": "学習に使用したデータセットの著作権に問題が発覚したため。",
    "選択肢c": "非常に自然な文章を生成でき、フェイクニュース作成など悪用の危険性が懸念されたため。",
    "選択肢d": "モデルのバグが多く、安定した動作が保証できなかったため。",
    "正解": "c",
    "解説": "GPT-bは、その当時としては驚異的に流暢で説得力のある文章を生成できたため、開発したOpenAIは、悪意のある者が偽情報の拡散などに悪用するリスクを懸念しました。そのため、段階的にモデルを公開するという慎重なアプローチを取りました。\na、b、dは、公開が控えられた理由とは異なります。性能の高さゆえの懸念が理由でした。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 33,
    "問題文": "GPT-3.5とInstructGPT、そしてRLHFの関係について、最も適切なものはどれか。",
    "選択肢a": "GPT-3.5は、InstructGPTとは異なり、RLHFを採用していない。",
    "選択肢b": "InstructGPTはGPT-3.5の改良版であり、RLHFを初めて採用した。",
    "選択肢c": "GPT-3.5とInstructGPTは、どちらもRLHF（人間のフィードバックによる強化学習）を採用している。",
    "選択肢d": "RLHFは、GPT-4で初めて導入された技術であり、GPT-3.5には採用されていない。",
    "正解": "c",
    "解説": "RLHF（Reinforcement Learning from Human Feedback）は、人間の評価者がAIの回答をランク付けし、そのフィードバックを報酬としてAIを強化学習させる手法です。InstructGPTでその有効性が示され、ChatGPTの基盤となったGPT-3.5でも同様に採用されています。\naは、誤りです。GPT-3.5もRLHFを採用しています。\nbは、時系列が逆です。GPT-3.5はInstructGPTの知見を基に開発されました。\ndは、誤りです。RLHFはGPT-3の世代から導入されています。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 34,
    "問題文": "AIにおける「ハルシネーション」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "AIが、学習データにはない独創的で芸術的な画像を生成する現象。",
    "選択肢b": "AIが、事実に基づかない誤った情報を、もっともらしく生成する現象。",
    "選択肢c": "AIが、複数のタスクを同時に処理しようとして、処理速度が低下する現象。",
    "選択肢d": "GPT-3.5はGPT-4と比較して、ハルシ네ーションの割合が低い。",
    "正解": "b",
    "解説": "ハルシネーション（幻覚）は、大規模言語モデルが、事実と異なる内容や文脈に合わない情報を、あたかも真実であるかのように自信を持って生成してしまう現象を指します。\naは、AIによる画像生成機能そのものを指しており、ハルシネーションの定義とは異なります。\ncは、マルチタスクにおける性能の問題であり、ハルシネーションとは異なります。\ndは、逆です。OpenAIの報告によると、GPT-4はGPT-3.5と比較してハルシネーションの発生率が大幅に低下しています。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 35,
    "問題文": "GPT-4が「マルチモーダルなモデル」であるとは、どのような意味か。",
    "選択肢a": "英語、日本語、中国語など、複数の言語を流暢に操れるという意味。",
    "選択肢b": "テキストだけでなく、画像や音声など複数の種類のデータ（モダリティ）を処理できるという意味。",
    "選択肢c": "プログラミング、要約、翻訳など、複数のタスクをこなせるという意味。",
    "選択肢d": "一つの回答を生成するために、複数の思考プロセスを経るという意味。",
    "正解": "b",
    "解説": "マルチモーダルとは、複数のモダリティ（様式・種類）を扱う能力を指します。GPT-dは、従来のテキスト入力に加え、画像を入力として与え、その内容について質問に答えたり説明を生成したりすることが可能です。\naは、多言語対応能力の説明です。\ncは、汎用性の説明です。\ndは、思考の連鎖（Chain of Thought）などのプロンプト技術に関する説明であり、マルチモーダルとは異なります。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 36,
    "問題文": "ChatGPTの機能である「Code Interpreter」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "ユーザーが書いたPythonコードの文法的な誤りをチェックし、修正案を提示する機能。",
    "選択肢b": "ChatGPT自身がPythonコードを生成・実行し、データ分析やグラフ作成などを行える機能。",
    "選択肢c": "Python以外のプログラミング言語（JavaやC++など）も実行できる機能。",
    "選択肢d": "ユーザーのPCにPythonの実行環境を自動でインストールする機能。",
    "正解": "b",
    "解説": "Code Interpreter（現：Advanced Data Analysis）は、ChatGPTの対話環境内で隔離されたPython実行環境を呼び出す機能です。ユーザーの指示に基づき、ChatGPTが自らコードを書き、それを実行してファイル操作、データ分析、グラフ描画などを行い、結果をユーザーに返します。\naは、機能の一部ではありますが、コードを自ら実行できる点がより本質的な特徴です。\ncは、誤りです。実行できるのはPythonのみです。\ndは、ユーザーのローカル環境には影響を与えません。安全なサンドボックス環境で実行されます。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 37,
    "問題文": "ChatGPTの「GPTs」機能に関する説明として、最も適切なものはどれか。",
    "選択肢a": "特定の目的に特化した独自のChatGPTを作成でき、外部APIとの連携も可能である。",
    "選択肢b": "過去のGPTモデル（GPT-2やGPT-3）を自由に切り替えて試せる機能である。",
    "選択肢c": "独自のChatGPTを作成できるが、外部のAPIと連携させることはできない。",
    "選択肢d": "OpenAIが公式に提供する、専門分野に特化した複数のGPTの総称である。",
    "正解": "a",
    "解説": "GPTsは、ユーザーが特定の役割や知識、機能を持たせたカスタム版のChatGPTを作成できる機能です。対話形式で設定でき、特定のファイルを知識ベースとして参照させたり、外部サービスのAPIを呼び出すアクションを設定したりすることも可能です。\nbは、そのような機能ではありません。\ncは、誤りです。外部APIとの連携（Actions）はGPTsの重要な機能の一つです。\ndは、ユーザー自身が作成・公開できる点が特徴であり、公式提供のものだけを指すわけではありません（GPTストアで共有されます）。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 38,
    "問題文": "2024年5月にリリースされたGPT-4oに関する説明として、最も適切なものはどれか。",
    "選択肢a": "「o」は「optimized（最適化された）」を意味し、GPT-4の実行速度を改善したモデルである。",
    "選択肢b": "テキスト処理に特化しており、画像や音声の処理能力は削除されている。",
    "選択肢c": "「o」は「omni（全ての）」を意味し、テキスト、音声、画像を統合的に高速で処理できる。",
    "選択肢d": "オープンソース（Open-source）として公開されたため、「o」という名前がついている。",
    "正解": "c",
    "解説": "GPT-4oの「o」は「omni（オムニ）」の略で、「全て」を意味します。このモデルは、テキスト、音声、画像を単一のニューラルネットワークで統合的に処理する「オムニモーダル」AIです。これにより、人間同士の対話のように、非常に低い遅延で音声対話を行うことが可能になりました。\naは、速度改善は結果の一つですが、「o」の意味が異なります。\nbは、逆の説明です。音声や画像の処理能力が大幅に強化されています。\ndは、GPT-4oはオープンソースモデルではありません。",
    "ジャンル": "生成モデルの歴史"
  },
  {
    "id": 39,
    "問題文": "自然言語処理（NLP）に関する説明として、最も適切なものはどれか。",
    "選択肢a": "コンピュータの処理速度を向上させるためのハードウェア技術。",
    "選択肢b": "コンピュータに、人間の言葉を理解させたり生成させたりするための技術。",
    "選択肢c": "コンピュータに、画像や動画の内容を理解させるための技術。",
    "選択肢d": "コンピュータに、人間の定めた厳密なルールのみを処理させるための技術。",
    "正解": "b",
    "解説": "自然言語処理（NLP）とは、私たちが日常的に使う言葉（自然言語）をコンピュータに処理させるための一連の技術です。これにより、機械翻訳、文章要約、対話システムなどが実現します。\naは、CPUやメモリなどのハードウェアに関する説明です。\ncは、コンピュータビジョン（画像認識）に関する説明です。\ndは、ルールベースのシステムに関する説明であり、曖昧さを含む自然言語を扱うNLPとはアプローチが異なります。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 40,
    "問題文": "テキスト生成AIの利用における課題・リスクとして、最も適切なものはどれか。",
    "選択肢a": "常に客観的で中立な文章しか生成できず、創造的な文章の作成には向かない。",
    "選択肢b": "学習データに含まれる偏見をAIが学習し、差別的な表現を含む文章を生成する可能性がある。",
    "選択肢c": "一度学習するとモデルの更新ができないため、新しい情報に対応できない。",
    "選択肢d": "テキスト生成AIの登場により、社会における偏見や差別的な表現が完全になくなる。",
    "正解": "b",
    "解説": "テキスト生成AIは、インターネット上の大量のテキストデータを学習します。そのため、データ内に存在する偏見や差別的な考え方をそのまま学習してしまい、不適切なコンテンツを生成してしまうリスクが指摘されています。\naは、逆です。AIは創造的な文章も生成できますが、常に客観的とは限りません。\ncは、誤りです。AIモデルは新しいデータで再学習（ファインチューニングなど）させることが可能です。\ndは、希望的観測であり、むしろAIが偏見を助長する可能性も懸念されています。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 41,
    "問題文": "テキスト生成AIが社会に与える可能性のある問題として、最も懸念されることはどれか。",
    "選択肢a": "コンピュータの消費電力が大幅に減少し、エネルギー問題が解決する。",
    "選択肢b": "偽情報の生成・拡散、プライバシー侵害、セキュリティ上の脅威といった問題。",
    "選択肢c": "生成される文章が完璧すぎるため、人間の文章作成能力が不必要になる。",
    "選択肢d": "AIが生成した文章は全て著作権フリーになるため、クリエイターの権利が保護される。",
    "正解": "b",
    "解説": "テキスト生成AIは、もっともらしい偽情報（フェイクニュース）を大規模に生成したり、個人情報を不適切に扱ったり、サイバー攻撃（例：フィッシングメールの作成）に悪用されたりするリスクがあります。\naは、逆です。大規模AIの学習・運用には膨大な電力が必要であり、消費電力の増加が懸念されています。\ncは、極端な見方です。人間の創造性や批判的思考は依然として重要です。\ndは、誤りです。AI生成物の著作権は、国や地域によって法的な議論が続いており、複雑な問題を抱えています。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 42,
    "問題文": "画像生成AIにおいて、一般的に画像データ作成手法として用いられないモデルはどれか。",
    "選択肢a": "GAN（敵対的生成ネットワーク）",
    "選択肢b": "VAE（変分オートエンコーダ）",
    "選択肢c": "RNN（回帰型ニューラルネットワーク）",
    "選択肢d": "拡散モデル（Diffusion Model）",
    "正解": "c",
    "解説": "RNNは、情報の順序が重要な時系列データ（シーケンスデータ）の扱いに長けたモデルです。そのため、文章や音声、音楽の生成には適していますが、空間的な情報を持つ画像の生成に直接用いられることは稀です。\na、b、dは、いずれも現代の画像生成AIにおいて中心的に利用されている代表的なモデルです。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 43,
    "問題文": "画像生成AIにおける画像データ作成手法として、一般的に用いられるモデルの組み合わせはどれか。",
    "選択肢a": "ルールベースと決定木",
    "選択肢b": "RNNとLSTM",
    "選択肢c": "GANやVAE",
    "選択肢d": "k-means法と主成分分析",
    "正解": "c",
    "解説": "GAN（敵対的生成ネットワーク）やVAE（変分オートエンコーダ）、そして近年主流の拡散モデルは、ディープラーニングを用いて新しい画像データを生成するための代表的な手法です。\naは、古典的な機械学習の手法です。\nbは、主に時系列データを扱うためのモデルです。\ndは、主にクラスタリングや次元削減に用いられる教師なし学習の手法です。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 44,
    "問題文": "画像生成AIの学習の前処理として、一般的に行われることはどれか。",
    "選択肢a": "全ての画像データに手動で詳細な説明文（キャプション）を付ける。",
    "選択肢b": "画像のファイル名を全て連番に変更する。",
    "選択肢c": "画像のサイズを統一し、ピクセル値を正規化し、データを水増し（増量）する。",
    "選択肢d": "全ての画像を白黒（グレースケール）に変換する。",
    "正解": "c",
    "解説": "学習を効率的かつ効果的に進めるため、入力する画像のサイズを揃えたり、ピクセル値を特定の範囲（例：0〜1）に収まるように正規化したりします。また、画像の回転や反転などを行い、学習データ量を擬似的に増やすデータ増強（Data Augmentation）も一般的に行われます。\naは、キャプション付けは行われますが、手動とは限らず、また全てに行うわけではありません。\nbは、学習の本質とは関係ありません。\ndは、色情報を失うため、カラー画像を扱いたい場合には不適切な前処理です。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 45,
    "問題文": "音楽生成AIの学習データとして、一般的に用いられるファイル形式はどれか。",
    "選択肢a": "JPEGファイル",
    "選択肢b": "PDFファイル",
    "選択肢c": "MIDIファイル",
    "選択肢d": "DOCXファイル",
    "正解": "c",
    "解説": "MIDIファイルは、演奏情報（どの音を、どのタイミングで、どのくらいの強さで鳴らすかなど）を記録したデータ形式です。音符のシーケンスとして扱えるため、音楽の構造をAIに学習させるのに非常に適しています。\naは、画像ファイル形式です。\n2とdは、文書ファイル形式です。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 46,
    "問題文": "音楽生成AIにおいて、RNN（回帰型ニューラルネットワーク）が適している理由として、最も適切なものはどれか。",
    "選択肢a": "画像の空間的な特徴を抽出するのが得意だから。",
    "選択肢b": "音符の連なりといった、順序が重要なシーケンスデータの処理に長けているから。",
    "選択肢c": "非常に少ない計算コストで、高速に学習を完了できるから。",
    "選択肢d": "生成器と識別器が競い合う構造を持っているから。",
    "正解": "b",
    "解説": "音楽は、音符が時間順に並んだシーケンスデータと考えることができます。RNNは過去の情報を記憶しながら次のデータを予測する仕組みを持つため、音楽のような時系列データのパターンを学習し、自然なメロディやハーモニーを生成するのに適しています。\naは、CNNの説明です。\ncは、誤りです。RNN、特にその発展形であるLSTMなどは計算コストが高い場合があります。\ndは、GANの説明です。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 47,
    "問題文": "生成AIを「データの補完・拡張」に利用する例として、最も適切なものはどれか。",
    "選択肢a": "収集したデータセットのうち、不足している部分や欠損している箇所をAIに予測させて補わせる。",
    "選択肢b": "データセットの容量を削減するために、関連性の低いデータをAIに自動で削除させる。",
    "選択肢c": "AIにデータセットの管理を任せ、セキュリティを強化する。",
    "選択肢d": "データセット内の個人情報をAIに検出させ、自動でマスキング処理を行う。",
    "正解": "a",
    "解説": "生成AIは、既存のデータの文脈やパターンを学習する能力があります。この能力を応用し、データの一部が欠けている場合に、周囲のデータから最も確からしい値を予測して補完したり、既存のデータに似た新しいデータを生成してデータセットを拡張したりすることが可能です。\nb、c、dもAIの有用な活用例ですが、「生成」による補完・拡張という文脈とは異なります。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 48,
    "問題文": "音声生成AI（Text-to-Speechなど）のトレーニングで、一般的に用いられる学習手法はどれか。",
    "選択肢a": "教師なし学習",
    "選択肢b": "自己教師あり学習",
    "選択肢c": "強化学習",
    "選択肢d": "教師あり学習",
    "正解": "d",
    "解説": "音声生成AIの学習では、大量の「テキスト（文章）」と、そのテキストを人間が読み上げた「音声データ」をペアにしてAIに与えます。この「テキスト」が正解データ（教師データ）となるため、この学習方法は教師あり学習に分類されます。\na、b、cは、他の目的で使われる学習手法であり、テキストと音声の対応関係を直接学習するこのタスクには通常用いられません。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 49,
    "問題文": "動画生成AIのトレーニングに関する記述として、最も適切なものはどれか。",
    "選択肢a": "動画生成において、GANとVAEは構造が複雑すぎるため利用されない。",
    "選択肢b": "ルールベースの手法が主流であり、ディープラーニングはほとんど用いられない。",
    "選択肢c": "GANやVAEは、動画生成において一般的に用いられる代表的な手法である。",
    "選択肢d": "動画の各フレームは独立しているため、フレーム間の関連性を考慮する必要はない。",
    "正解": "c",
    "解説": "動画生成AIでは、一枚一枚のフレーム（静止画）を生成する能力と、それらを時間的に自然につなぎ合わせる能力の両方が求められます。フレーム生成にはGANやVAEなどの画像生成技術が、時間的な一貫性の保持にはRNNなどの時系列モデルが応用されます。\n1とbは、現状とは異なる誤った記述です。\ndは、逆です。フレーム間の一貫性を保つことが、自然な動画を生成する上で非常に重要です。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 50,
    "問題文": "動画生成AIの学習における前処理と注意点として、最も適切なものはどれか。",
    "選択肢a": "AIが処理しやすいように動画をフレームごとに分割するが、フレーム間の一貫性を保つことが重要である。",
    "選択肢b": "学習効率を上げるため、動画の解像度を可能な限り低く（例：10x10ピクセル）する。",
    "選択肢c": "動画の音声データは学習のノイズになるため、全ての前処理段階で除去する必要がある。",
    "選択肢d": "動画をフレームに分割せず、動画ファイル全体を一度にAIに入力するのが一般的である。",
    "正解": "a",
    "解説": "動画は連続した静止画（フレーム）の集まりです。AIは通常、このフレーム単位でデータを処理します。しかし、生成される動画が自然に見えるためには、前のフレームと次のフレームの内容が滑らかに繋がっていること、つまり時間的な一貫性が保たれていることが不可欠です。\nbは、極端な解像度の低下は情報の損失が大きすぎ、学習に悪影響を与えます。\ncは、音声も重要な情報であり、音声と映像を連携させるモデルでは必須のデータです。\ndは、計算量やメモリの観点から非常に困難であり、一般的ではありません。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 51,
    "問題文": "動画生成AIのトレーニングにおいて、RNN（またはその発展形）が利用される理由として、最も適切なものはどれか。",
    "選択肢a": "一枚の画像の品質を向上させるため。",
    "選択肢b": "動画のファイルサイズを圧縮するため。",
    "選択肢c": "時間的に連続するフレーム間の一貫性をモデル化するため。",
    "選択肢d": "動画内の物体を検出するため。",
    "正解": "c",
    "解説": "動画はフレームの「シーケンス（連続したデータ）」です。RNNは過去の情報を記憶しながら次の出力を予測する能力を持つため、前のフレームの内容を踏まえて次のフレームを生成し、動画全体として滑らかな動きや変化を表現するのに役立ちます。\n1とdは、主にCNNが得意とするタスクです。\nbは、コーデックなどの圧縮技術の領域であり、生成モデルの主な目的とは異なります。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 52,
    "問題文": "生成AIがもたらすメリットとして挙げられる「アクセシビリティの向上」とは、具体的にどのようなことか。",
    "選択肢a": "AIの利用に高価な専用コンピュータが不要になること。",
    "選択肢b": "専門的なスキルがなくても、誰もが文章、音楽、画像などを容易に制作できるようになること。",
    "選択肢c": "生成AIに関する情報が、インターネット上で簡単に見つかるようになること。",
    "選択肢d": "AIが生成したコンテンツは、全ての人にとって理解しやすい内容になること。",
    "正解": "b",
    "解説": "従来はプログラミング、デザイン、作曲などの専門的な知識や技術が必要だった作業を、自然言語による指示（プロンプト）だけでAIに実行させることができます。これにより、多くの人々にとって創造的な活動への参入障壁が劇的に下がりました。\na、c、dは、アクセシビリティに関連する側面もありますが、ここで言う「アクセシビリティの向上」の最も中心的な意味とは少し異なります。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 53,
    "問題文": "生成AIの普及に伴うデメリットや社会的懸念として、最も代表的なものはどれか。",
    "選択肢a": "人間の創造性が刺激され、新しいアートの形が生まれる。",
    "選択肢b": "定型的な業務が自動化され、人間はより創造的な仕事に集中できる。",
    "選択肢c": "特定の業界（イラストレーター、ライターなど）の職業がAIに代替され、雇用に影響を与える可能性がある。",
    "選択肢d": "教育分野での活用が進み、個別最適化された学習が可能になる。",
    "正解": "c",
    "解説": "生成AIが人間と同等、あるいはそれ以上の品質でコンテンツを生成できるようになると、これまで人間が担ってきた仕事の需要が減少する可能性が懸念されています。これは、AIの導入を検討する上で重要な社会的・倫理的課題の一つです。\na、b、dは、生成AIがもたらすメリットやポジティブな側面の例です。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 54,
    "問題文": "「ディープフェイク」技術に関する説明として、最も適切なものはどれか。",
    "選択肢a": "AIが学習データにない情報を生成してしまう「ハルシネーション」の別名。",
    "選択肢b": "ディープラーニングを用いて、実在の人物が言ってもいないことや、してもいないことをしているかのような、非常にリアルな偽の動画などを作成する技術。",
    "選択肢c": "AIの判断根拠が人間には理解できない「ブラックボックス問題」を指す言葉。",
    "選択肢d": "AIを利用して、画像の解像度を向上させるための技術の総称。",
    "正解": "b",
    "解説": "ディープフェイクは、「ディープラーニング」と「フェイク（偽物）」を組み合わせた造語です。主に、人の顔を別人の顔と入れ替えたり、顔の表情や口の動きを操作したりして、本物と見分けがつきにくい精巧な偽のコンテンツを作成する目的で使われます。\na、c、dは、AIに関連する別の技術や問題を指す言葉です。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 55,
    "問題文": "ディープフェイクがもたらすリスクに関する記述として、最も適切なものはどれか。",
    "選択肢a": "技術が未熟で、生成された映像は誰が見ても偽物だと簡単にわかるため、リスクは低い。",
    "選択肢b": "作成には高度な専門知識が必要なため、一般人が悪用することは不可能である。",
    "選択肢c": "非常に精巧な偽情報が生成・拡散される可能性があり、人間の目やAIでも見分けるのが困難な場合がある。",
    "選択肢d": "ディープフェイクは主に教育目的で利用されるため、社会的な問題を引き起こすことはない。",
    "正解": "c",
    "解説": "近年のディープフェイク技術の進歩は著しく、生成されるコンテンツの品質は非常に高くなっています。そのため、悪意を持って作成された場合、世論操作、詐欺、個人の名誉毀損など、深刻な社会問題を引き起こすリスクが大きな懸念となっています。\n1とbは、現状を楽観視しすぎた誤った認識です。技術の進歩とツールの普及により、リスクは高まっています。\ndは、用途を限定した誤った記述です。悪用のリスクが大きな問題とされています。",
    "ジャンル": "現在の生成AIの動向"
  },
  {
    "id": 56,
    "問題文": "インターネットリテラシーを構成する要素として、適切でないものはどれか。",
    "選択肢a": "テクノロジーの基本的な仕組みの理解",
    "選択肢b": "SNSにおけるフォロワー数や「いいね」の数",
    "選択肢c": "セキュリティリスクやプライバシー保護に関する知識",
    "選択肢d": "インターネット上の情報を正しく評価し活用する能力（情報リテラシー）",
    "正解": "b",
    "解説": "SNSにおけるフォロワー数や「いいね」の数は個人の影響力を示す指標の一つかもしれませんが、インターネットを安全かつ効果的に利用するための知識や能力であるインターネットリテラシーそのものを構成する要素ではありません。\na、c、dは、いずれもインターネットリテラシーの重要な構成要素です。これには、技術の理解、情報リテラシー、セキュリティとプライバシー、デジタル市民権などが含まれます。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 57,
    "問題文": "正規の機関やサービス提供者を装い、個人情報や金融情報を不正に盗み取ろうとする詐欺の手口を何と呼ぶか。",
    "選択肢a": "ランサムウェア",
    "選択肢b": "マルウェア",
    "選択肢c": "フィッシング詐欺",
    "選択肢d": "ソーシャルエンジニアリング",
    "正解": "c",
    "解説": "フィッシング詐欺は、信頼できる送信元を装ったメールやSMS、偽のWebサイトなどを通じて、ユーザーを巧みに騙し、ID、パスワード、クレジットカード情報などを入力させて盗み取る手口です。\naは、データを暗号化して身代金を要求するマルウェアです。\nbは、悪意のあるソフトウェア全般を指す総称です。\ndは、人の心理的な隙をついて情報を盗む手法の総称であり、フィッシング詐欺もその一種です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 58,
    "問題文": "QRコードのセキュリティに関する記述として、最も適切なものはどれか。",
    "選択肢a": "QRコード自体にウイルスを埋め込むことができるため、スキャンするだけで感染する。",
    "選択肢b": "公式の店舗などに掲示されているQRコードは、第三者によって差し替えられる危険性はない。",
    "選択肢c": "QRコードのリンク先が偽サイトである可能性があり、安易にスキャンすると危険な場合がある。",
    "選択肢d": "暗号化されているため、QRコードを悪用した詐欺は原理的に不可能である。",
    "正解": "c",
    "解説": "QRコードの便利さを逆手に取り、見た目ではわからないように悪意のあるWebサイトへのリンクが設定されたQRコードを用意したり、正規のQRコードの上に偽のものを貼り付けたりする手口があります。スキャンする際は、誘導されるURLなどを確認する注意が必要です。\naは、QRコードは単なるデータ（主にURL）であり、それ自体にウイルスが埋め込まれるわけではありません。危険なのはそのリンク先です。\nbは、物理的に偽のQRコードシールに貼り替えられる「キッシング」と呼ばれる手口が存在します。\ndは、QRコードのデータは暗号化されておらず、誰でも読み取れます。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 59,
    "問題文": "フリーWi-Fiの利用に関する注意点として、最も適切なものはどれか。",
    "選択肢a": "パスワードが設定されているフリーWi-Fiは、通信内容が暗号化されているため安全である。",
    "選択肢b": "カフェや施設の名前が付いたWi-Fiは、必ずその施設が提供している正規のネットワークである。",
    "選択肢c": "悪意のある者が正規のWi-Fiに見せかけたアクセスポイントを設置している可能性があり、注意が必要である。",
    "選択肢d": "フリーWi-Fiは公衆向けであるため、法律で通信の安全性が保証されている。",
    "正解": "c",
    "解説": "攻撃者が正規のWi-Fiとそっくりの名前（SSID）を持つ偽のアクセスポイント（「悪魔の双子」などと呼ばれる）を設置し、利用者を誤って接続させて通信内容を盗聴する手口があります。Wi-Fiの名称だけで安全だと判断するのは危険です。\naは、パスワード（暗号化キー）が店内に公開されている場合、同じWi-Fiに接続している攻撃者には通信内容を解読される可能性があります。\nbは、上記のように偽装されている可能性があるため、必ずしも正規とは限りません。\ndは、そのような法律はなく、フリーWi-Fiの利用は自己責任が原則です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 60,
    "問題文": "インターネット利用におけるセキュリティの脅威について、最も適切なものはどれか。",
    "選択肢a": "脅威は主にデータのダウンロード時に存在し、アップロードは安全である。",
    "選択肢b": "脅威は主にデータのアップロード時に存在し、ダウンロードは安全である。",
    "選択肢c": "データのダウンロード時（マルウェア感染など）とアップロード時（情報漏洩など）の両方に脅威が存在する。",
    "選択肢d": "最新のOSを使っていれば、ダウンロード・アップロードともに脅威は存在しない。",
    "正解": "c",
    "解説": "インターネットの利用には、ダウンロードとアップロードの両方の側面にリスクが伴います。ダウンロード時にはマルウェアに感染する危険性があり、アップロード時には意図せず個人情報や機密情報を漏洩させてしまう危険性があります。\n1とbは、片方のリスクしか考慮しておらず、不適切です。\ndは、OSを最新に保つことは重要ですが、それだけで全ての脅威を防げるわけではありません。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 61,
    "問題文": "コンピュータや利用者に被害をもたらすことを目的とした、悪意のあるソフトウェアの総称を何と呼ぶか。",
    "選択肢a": "アドウェア",
    "選択肢b": "ファームウェア",
    "選択肢c": "マルウェア",
    "選択肢d": "シェアウェア",
    "正解": "c",
    "解説": "マルウェア（Malware）は、「malicious software（悪意のあるソフトウェア）」を短縮した言葉で、ウイルス、ワーム、トロイの木馬、ランサムウェア、スパイウェアなど、利用者に害をなすソフトウェア全般を指します。\naは、広告を表示するソフトウェアで、必ずしも悪意があるとは限りません。\nbは、ハードウェアを制御するためのソフトウェアです。\ndは、試用後に料金を支払う形式のソフトウェアです。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 62,
    "問題文": "マルウェア対策に関する記述として、最も慎重な行動はどれか。",
    "選択肢a": "アンチウイルスソフトを最新にしていれば、どんなファイルを開いても自動で駆除されるので安全である。",
    "選択肢b": "友人から送られてきたファイルは、ウイルスに感染している可能性はないので安全である。",
    "選択肢c": "アンチウイルスソフトの導入に加え、不審なメールや提供元が不明なファイルは開かないようにする。",
    "選択肢d": "拡張子が「.exe」のファイルのみが危険であり、それ以外のファイルは安全である。",
    "正解": "c",
    "解説": "アンチウイルスソフトは重要な防御策ですが、全てのマルウェアを100%検知できるわけではありません。そのため、ソフトによる対策と合わせて、利用者自身が「不審なファイルを開かない」「怪しいリンクをクリックしない」といった慎重な行動を心がけることが不可欠です。\naは、過信であり危険です。未知のマルウェアなどは検知できない可能性があります。\nbは、友人のPCがマルウェアに感染し、意図せずウイルス付きのメールを送信している可能性があります。\ndは、誤りです。文書ファイル（Word, Excel, PDFなど）のマクロ機能を悪用するマルウェアなど、様々な形式が存在します。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 63,
    "問題文": "感染したコンピュータのデータを暗号化し、その復号（元に戻すこと）と引き換えに金銭を要求するマルウェアを何と呼ぶか。",
    "選択肢a": "スパイウェア",
    "選択肢b": "トロイの木馬",
    "選択肢c": "ワーム",
    "選択肢d": "ランサムウェア",
    "正解": "d",
    "解説": "ランサムウェアは、「Ransom（身代金）」と「Software」を組み合わせた造語です。感染するとファイルが勝手に暗号化されて開けなくなり、元に戻すための身代金を要求する脅迫画面が表示されます。\naは、利用者の情報を盗み出すマルウェアです。\nbは、無害なプログラムを装って侵入し、後から悪意のある活動を行うマルウェアです。\ncは、自己増殖しながらネットワーク経由で他のコンピュータに感染を広げるマルウェアです。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 64,
    "問題文": "フィッシング詐欺への対策として、有効なものはどれか。",
    "選択肢a": "メールに記載された銀行のロゴが本物であれば、リンク先も本物だと判断する。",
    "選択肢b": "メール本文に自分の名前が記載されていれば、信頼できるメールだと判断する。",
    "選択肢c": "メール内のリンクは安易にクリックせず、ブックマークや公式アプリからサービスにアクセスする。",
    "選択肢d": "送信元のメールアドレスが知っているドメインであれば、必ず本人からのメールだと判断する。",
    "正解": "c",
    "解説": "フィッシング詐欺の多くは、メール内のリンクから偽サイトへ誘導する手口です。メール内のリンクに頼らず、普段から利用している公式サイトのブックマークや、公式のスマートフォンアプリ経由でアクセスする習慣をつけることが、非常に有効な対策となります。\naは、ロゴ画像は簡単にコピーできるため、判断基準になりません。\nbは、漏洩した名簿などから名前を入手し、巧妙に騙そうとする手口（スピアフィッシング）があります。\ndは、送信元メールアドレスは偽装が可能です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 65,
    "問題文": "特定の個人や組織を狙い、業務連絡などを装って巧妙に偽装したメールを送りつける、標的型のフィッシング攻撃を何と呼ぶか。",
    "選択肢a": "ベイト攻撃",
    "選択肢b": "スピアフィッシング",
    "選択肢c": "プレテキスト",
    "選択肢d": "ブラックメール",
    "正解": "b",
    "解説": "スピアフィッシングは、「Spear（槍）」で狙いを定めるように、不特定多数ではなく特定のターゲットを狙う攻撃です。事前にターゲットの情報を調査し、本物の業務メールと見分けがつきにくい、非常に巧妙な内容のメールで騙そうとします。\naは、魅力的な情報でユーザーの興味をひく手口です。\ncは、偽のシナリオを作り出してターゲットを騙す手口です。\ndは、入手した秘密を暴露するなどと脅迫する手口です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 66,
    "問題文": "魅力的に見える情報（例：「景品に当選しました」）でユーザーの興味をひき、個人情報を入力させたり、マルウェアをダウンロードさせたりするソーシャルエンジニアリングの手法を何と呼ぶか。",
    "選択肢a": "ベイト攻撃",
    "選択肢b": "スケアウェア",
    "選択肢c": "プレテキスト",
    "選択肢d": "ホエーリング",
    "正解": "a",
    "解説": "ベイト攻撃は、「Bait（餌）」で魚を釣るように、利用者の好奇心や欲望を利用する手口です。無料の映画ダウンロードや景品当選などを謳い、利用者を罠にかけます。\nbは、偽の警告画面で利用者を怖がらせ、ソフトを買わせたりする手口です。\ncは、攻撃者が作り上げた偽のシナリオを前提（プレテキスト）として、ターゲットを騙す手口です。\ndは、企業の経営層など、重要な役職者（大きな獲物）を狙うスピアフィッシングの一種です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 67,
    "問題文": "攻撃者がターゲットの秘密情報を入手し、「この情報を公開されたくなければ金銭を支払え」と脅迫するソーシャルエンジニアリングの手法を何と呼ぶか。",
    "選択肢a": "ショルダーハッキング",
    "選択肢b": "トラッシング",
    "選択肢c": "ブラックメール",
    "選択肢d": "スピアフィッシング",
    "正解": "c",
    "解説": "ブラックメールは、日本語では「恐喝」にあたる行為です。攻撃者は、何らかの方法で入手したターゲットのプライベートな情報や、業務上の不正の証拠などを盾に、口止め料として金銭などを要求します。\naは、パスワードなどを入力しているところを肩越しに盗み見る行為です。\nbは、ゴミ箱を漁って機密情報を探し出す行為です。\ndは、標的型のフィッシング攻撃です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 68,
    "問題文": "インターネットやアプリケーションのプライバシー設定に関する記述として、最も適切なものはどれか。",
    "選択肢a": "プライバシー設定は一度行えば、その後変更する必要はない。",
    "選択肢b": "デフォルト（初期設定）の状態が最も安全な設定になっているため、変更しない方がよい。",
    "選択肢c": "プライバシー設定を適切に行わないと、意図せず個人情報が公開・収集される可能性がある。",
    "選択肢d": "日本のアプリケーションは、法律でプライバシーが完全に保護されるため設定は不要である。",
    "正解": "c",
    "解説": "多くのサービスでは、自分の情報をどこまで公開するか、どのような情報をサービス提供者に提供するかなどを、プライバシー設定でコントロールできます。この設定を確認・変更しないと、自分が意図しない範囲まで個人情報が第三者から閲覧されたり、企業に収集されたりするリスクがあります。\naは、サービスの仕様変更や新しい機能の追加に伴い、設定の見直しが必要になることがあります。\nbは、多くの場合、デフォルト設定はサービス提供者にとって都合の良い（多くの情報を収集できる）設定になっていることがあります。\ndは、法律はありますが、最終的に自分の情報を守るためには利用者自身の適切な設定が不可欠です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 69,
    "問題文": "個人情報保護法の目的として、正しいものはどれか。",
    "選択肢a": "個人情報の有用性を犠牲にしてでも、個人の権利利益を最大限に保護すること。",
    "選択肢b": "個人情報の有用性に配慮しつつ、個人の権利利益を保護すること。",
    "選択肢c": "個人の権利利益よりも、事業者が個人情報を自由に活用できる環境を整備すること。",
    "選択肢d": "国の行政機関による個人情報の管理方法のみを定めること。",
    "正解": "b",
    "解説": "個人情報保護法は、個人のプライバシーや権利を守ることだけが目的ではありません。個人情報がパーソナライズされたサービスなど、社会にとって有用な形で活用されることにも配慮し、その「保護」と「利活用」のバランスを取ることを目的としています。\na、cは、どちらか一方に偏っており、法律の目的を正しく反映していません。\ndは、行政機関だけでなく、民間事業者も対象としています。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 70,
    "問題文": "個人情報保護法における「個人情報」の定義として、最も適切なものはどれか。",
    "選択肢a": "生存する個人に関する情報で、特定の個人を識別できるもの。",
    "選択肢b": "故人に関する情報も含め、特定の個人を識別できる全ての情報。",
    "選択肢c": "氏名、住所、生年月日、電話番号の4つの情報のみを指す。",
    "選択肢d": "インターネット上で公開されている個人に関する情報。",
    "正解": "a",
    "解説": "個人情報保護法では、「個人情報」は「生存する個人に関する情報」と定義されています。そのため、亡くなった方の情報は原則としてこの法律の対象外です。また、「特定の個人を識別できる」情報（氏名など）や、「個人識別符号」（マイナンバー、運転免許証番号など）が含まれるものが該当します。\nbは、「故人」が含まれているため不適切です。\ncは、例としては正しいですが、これらに限定されるわけではありません。\ndは、公開・非公開は問いません。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 71,
    "問題文": "「個人情報取扱事業者」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "5,000人分以上の個人情報を取り扱う事業者のみが該当する。",
    "選択肢b": "事業で個人情報データベース等を利用している者は、取り扱う個人情報の件数に関わらず該当する。",
    "選択肢c": "国や地方公共団体は、個人情報取扱事業者には含まれない。",
    "選択肢d": "営利目的の企業のみが該当し、非営利団体は含まれない。",
    "正解": "b",
    "解説": "以前の法律では5,000人分以下を取り扱う事業者は対象外でしたが、法改正によりその要件は撤廃されました。現在では、事業のために個人情報データベース等を取り扱っていれば、その件数に関係なく、全ての事業者が個人情報取扱事業者に該当します。\naは、古い情報です。\n3とdは、誤りです。国や地方公共団体、非営利団体も対象となります。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 72,
    "問題文": "次のうち、個人情報保護法における「個人情報」に該当しない可能性が最も高いものはどれか。",
    "選択肢a": "他の情報と照合することで特定の個人を識別できる、個人のメールアドレス",
    "選択肢b": "企業の公開されている財務情報",
    "選択肢c": "防犯カメラに記録された、特定の個人を識別できる顔の映像",
    "選択肢d": "従業員の氏名と社員番号が記載されたリスト",
    "正解": "b",
    "解説": "個人情報保護法は、あくまで「個人」に関する情報を対象としています。企業の財務情報のように、法人や団体に関する情報は、たとえ機密性が高くても、この法律でいう「個人情報」には該当しません。\na、c、dは、いずれも特定の個人を識別できるため、個人情報に該当します。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 73,
    "問題文": "本人に対する不当な差別や偏見などが生じないよう、特に配慮を要する個人情報を、個人情報保護法では何と呼ぶか。",
    "選択肢a": "機微情報",
    "選択肢b": "要配慮個人情報",
    "選択肢c": "匿名加工情報",
    "選択肢d": "営業秘密",
    "正解": "b",
    "解説": "要配慮個人情報は、その情報の性質上、取り扱いを誤ると本人に大きな不利益をもたらす可能性があるため、取得する際には原則として本人の同意が必要など、通常の個人情報よりも厳格なルールが定められています。\naは、金融分野のガイドラインなどで使われる言葉で、要配慮個人情報と範囲が似ていますが、法律上の用語ではありません。\ncは、個人を特定できないように加工した情報です。\ndは、不正競争防止法で保護される企業の秘密情報です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 74,
    "問題文": "次のうち、要配慮個人情報に含まれないものはどれか。",
    "選択肢a": "本人の信条（信仰する宗教など）",
    "選択肢b": "本人の病歴",
    "選択肢c": "本人のメールアドレス",
    "選択肢d": "本人の人種",
    "正解": "c",
    "解説": "個人のメールアドレスは「個人情報」には該当しますが、人種、信条、社会的身分、病歴、犯罪の経歴といった、不当な差別の原因となりうる機微な情報とは性質が異なるため、「要配慮個人情報」には含まれません。\na、b、dは、いずれも法律で定められた要配慮個人情報の典型例です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 75,
    "問題文": "「機微（センシティブ）情報」と「要配慮個人情報」の関係について、最も適切なものはどれか。",
    "選択肢a": "機微情報は要配慮個人情報よりも狭い概念である。",
    "選択肢b": "両者は全く同じ情報を指す、法律上の同義語である。",
    "選択肢c": "機微情報は金融分野のガイドライン等で定められ、要配慮個人情報よりも広い概念である。",
    "選択肢d": "要配慮個人情報は、機微情報を匿名加工したものである。",
    "正解": "c",
    "解説": "「要配慮個人情報」は個人情報保護法で定められた用語です。一方、「機微（センシティブ）情報」は主に金融分野のガイドラインで使われる用語で、要配慮個人情報の内容に加えて、労働組合への加盟や門地、本籍地なども含むため、一般的に「機微情報」の方が広い概念とされています。\n1とbは、誤りです。\ndは、全く異なる概念の説明です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 76,
    "問題文": "特定の個人を識別できないように、かつ、元の情報を復元できないように個人情報を加工した情報を何と呼ぶか。",
    "選択肢a": "仮名加工情報",
    "選択肢b": "個人関連情報",
    "選択肢c": "匿名加工情報",
    "選択肢d": "要配慮個人情報",
    "正解": "c",
    "解説": "匿名加工情報は、個人情報から氏名を削除したり、住所を都道府県名のみにしたりするなど、法律で定められた基準に従って加工することで、特定の個人を識別できないようにした情報です。これにより、プライバシーを保護しつつ、データを統計分析などに活用することが可能になります。\naは、他の情報と照合すれば本人を識別できる状態の加工情報で、匿名加工情報とは区別されます。\nbは、単体では個人情報ではないが、他の情報と結びつくことで個人情報となりうる情報（例：Cookie情報）です。\ndは、特に配慮が必要な機微な個人情報です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 77,
    "問題文": "新しい発明や技術などの「アイデア」を保護する権利は何か。",
    "選択肢a": "著作権",
    "選択肢b": "商標権",
    "選択肢c": "特許権",
    "選択肢d": "肖像権",
    "正解": "c",
    "解説": "特許権は、新規性や進歩性などの要件を満たす発明（技術的なアイデア）に対して、特許庁に出願・審査を経て登録されることで発生する独占的な権利です。\naは、思想や感情を創作的に表現した「表現物」（文芸、音楽、美術など）を保護します。\nbは、商品やサービスの「マーク」（名称やロゴ）を保護します。\ndは、個人の肖像（容姿など）を保護します。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 78,
    "問題文": "企業や商品のロゴマークなど、事業者が使用する「識別マーク」を保護する権利は何か。",
    "選択肢a": "著作権",
    "選択肢b": "商標権",
    "選択肢c": "特許権",
    "選択肢d": "パブリシティ権",
    "正解": "b",
    "解説": "商標権は、自社の商品やサービスを他社のものと区別するための文字、図形、記号、色彩などのマーク（商標）を保護する権利です。特許庁への出願・登録が必要です。\naは、創作的な「表現」を保護します。\ncは、技術的な「発明」を保護します。\ndは、著名人の肖像などが持つ顧客誘引力を保護します。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 79,
    "問題文": "小説、音楽、絵画、コンピュータプログラムなどの創作物（著作物）が完成した時点で、登録などの手続きを必要とせずに自動的に発生する権利は何か。",
    "選択肢a": "著作権",
    "選択肢b": "商標権",
    "選択肢c": "特許権",
    "選択肢d": "意匠権",
    "正解": "a",
    "解説": "著作権は、創作物が完成した瞬間に自動的に発生する「無方式主義」という考え方を採用しています。特許権や商標権のように、役所への出願や登録といった手続きは必要ありません。\nb、c、dは、いずれも特許庁への出願・登録手続きを経て初めて発生する権利です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 80,
    "問題文": "法律に明文の規定はないものの、判例上、憲法第13条の幸福追求権に基づき保護されると解釈されている、みだりに自らの容姿などを撮影・公表されない権利を何と呼ぶか。",
    "選択肢a": "著作権",
    "選択肢b": "プライバシー権",
    "選択肢c": "肖像権",
    "選択肢d": "パブリシティ権",
    "正解": "c",
    "解説": "肖像権は、法律の条文として直接規定されているわけではありません。しかし、最高裁判所の判例により、個人の人格的な利益を守るため、憲法上の権利として保護されるべきものと確立されています。\naは、著作物を保護する権利です。\nbは、私生活上の事柄をみだりに公開されない権利で、肖像権と密接に関連しますが、異なる概念です。\ndは、著名人の肖像の経済的価値を保護する権利で、肖像権の一部とされます。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 81,
    "問題文": "有名人の氏名や肖像が持つ、顧客を惹きつける経済的な価値（顧客誘引力）を無断で商業的に利用されない権利を何と呼ぶか。",
    "選択肢a": "名誉権",
    "選択肢b": "プライバシー権",
    "選択肢c": "著作権",
    "選択肢d": "パブリシティ権",
    "正解": "d",
    "解説": "パブリシティ権は、個人の肖像権に含まれる財産的な側面を保護する権利です。例えば、有名人の写真を無断で商品広告に使うといった行為は、このパブリシティ権の侵害にあたる可能性があります。\naは、人の社会的な評価を守る権利です。\nbは、私生活の平穏を守る権利です。\ncは、創作物を保護する権利です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 82,
    "問題文": "生成AI技術の進歩と、知的財産権や肖像権に関する記述として、最も適切なものはどれか。",
    "選択肢a": "生成AIはゼロから創作するため、既存の知的財産権を侵害する可能性はない。",
    "選択肢b": "AIが生成した著名人に似た画像は、本人の写真ではないため肖像権やパブリシティ権の問題は生じない。",
    "選択肢c": "生成AIの学習データに既存の著作物が使われることや、生成物が既存の作品に酷似することで、権利侵害の問題が生じる可能性がある。",
    "選択肢d": "AI技術の進歩により作業が効率化されるため、権利侵害の問題は自然に解決される。",
    "正解": "c",
    "解説": "生成AIは、学習の過程でインターネット上の膨大なデータ（著作物を含む）を利用します。そのため、AIの生成物が意図せず学習元の著作物と酷似してしまい著作権侵害となったり、特定の画家の画風を模倣したり、著名人の肖像に似た画像を生成したりすることで、知的財産権や肖像権、パブリシティ権を侵害するリスクが大きな課題となっています。\na、b、dは、リスクを過小評価した不適切な記述です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 83,
    "問題文": "不正競争防止法で保護される「営業秘密」として認められるための3つの要件に含まれないものはどれか。",
    "選択肢a": "有用性（事業活動に有用な情報であること）",
    "選択肢b": "新規性（まだ誰も知らない発明であること）",
    "選択肢c": "秘密管理性（秘密として管理されていること）",
    "選択肢d": "非公知性（公然と知られていないこと）",
    "正解": "b",
    "解説": "「新規性」は、特許を取得するための要件の一つです。不正競争防止法上の「営業秘密」の要件は、①秘密として管理され（秘密管理性）、②事業に役立つ技術上・営業上の情報であり（有用性）、③一般に知られていない（非公知性）の3つです。\na、c、dは、営業秘密の3要件です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 84,
    "問題文": "不正競争防止法で規制される、他人の「著名」な商品等表示と同一または類似のものを、自己の商品等表示として使用する行為を何と呼ぶか。",
    "選択肢a": "周知表示混同惹起行為",
    "選択肢b": "著名表示冒用行為",
    "選択肢c": "営業秘密侵害行為",
    "選択肢d": "技術的制限手段無効化行為",
    "正解": "b",
    "解説": "著名表示冒用行為は、全国的に有名なブランド名やロゴマークなどを、全く異なる分野の商品やサービスに無断で使用し、ブランドの価値や名声をタダ乗り（希釈化・汚染）するような行為を規制するものです。「周知」（ある程度知られている）よりも、さらに知名度が高い「著名」な表示が対象となります。\naは、「周知」な表示との間で「混同」を生じさせる行為を規制するものです。\n3とdは、別の種類の不正競争行為です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 85,
    "問題文": "AI生成物の著作権に関する記述として、最も適切なものはどれか。",
    "選択肢a": "AIが自律的に生成したものであり、いかなる場合も著作物には該当しない。",
    "選択肢b": "著作権は、常にAIを開発した企業に帰属する。",
    "選択肢c": "人が創作意図を持ち、AIを道具として利用して創作的な表現を生み出した場合、その人に著作権が認められる可能性がある。",
    "選択肢d": "AIが生成したものは全てパブリックドメインとなり、誰でも自由に利用できる。",
    "正解": "c",
    "解説": "日本の文化庁の見解などでは、AIが自動的に生成しただけでは「思想又は感情を創作的に表現した」という著作物の要件を満たしません。しかし、人間がAIを「道具」として使い、プロンプトの工夫など創作的な寄与が認められる場合には、その人間を著作者とする著作物が成立する可能性があるとされています。\na、b、dは、現在の一般的な法解釈とは異なる、断定的な記述であり不適切です。",
    "ジャンル": "リテラシー・権利"
  },
  {
    "id": 86,
    "問題文": "経済産業省・総務省の「AI事業者ガイドライン」において、「基本理念」として掲げられている3つの社会の姿に含まれないものはどれか。",
    "選択肢a": "人間の尊厳が尊重される社会",
    "選択肢b": "多様な背景を持つ人々が多様な幸せを追求できる社会",
    "選択肢c": "経済的効率性が最大化された社会",
    "選択肢d": "持続可能な社会",
    "正解": "c",
    "解説": "経済的効率性の最大化は、AI利活用の結果として期待される側面の一つかもしれませんが、ガイドラインが目指す社会の根幹として掲げる「基本理念」には含まれていません。基本理念は、「人間の尊厳（Dignity）」「多様性と包摂（Diversity & Inclusion）」「持続可能性（Sustainability）」の3つです。\na、b、dは、ガイドラインに明記されている3つの基本理念です。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 87,
    "問題文": "「AI事業者ガイドライン」において、AIの開発・提供・利用する各主体が留意すべき事項として定められている「共通の指針」は、全部でいくつあるか。",
    "選択肢a": "3項目",
    "選択肢b": "7項目",
    "選択肢c": "10項目",
    "選択肢d": "12項目",
    "正解": "c",
    "解説": "「共通の指針」は、人間中心、安全性、公平性、プライバシー保護、セキュリティ確保、透明性、アカウンタビリティ、教育・リテラシー、公正競争確保、イノベーションの全10項目から構成されています。\n1の「3項目」は、「基本理念」の数です。\n2とdは、誤りです。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 88,
    "問題文": "「共通の指針」の根幹をなす「人間中心」の原則に関する説明として、最も適切なものはどれか。",
    "選択肢a": "AIの判断を人間の判断よりも常に優先させることで、社会全体の効率性を高めるべきである。",
    "選択肢b": "AI開発者は、AIが人間の仕事を代替することを第一の目標として開発を進めるべきである。",
    "選択肢c": "AIの活用においては、国際的に認められた人権を侵害せず、人々の多様な幸せの追求を拡張するように行動すべきである。",
    "選択肢d": "人間がAIを管理しやすくするために、AIの能力を人間の知性を超えない範囲に制限すべきである。",
    "正解": "c",
    "解説": "「人間中心」の指針は、AIに関する全ての取り組みの土台となる考え方です。AIの利用が人権を尊重し、人々がより良く生きていく（well-being）ための可能性を広げるものであるべき、と定めています。\naは、「人間中心」の考え方とは逆です。\nbは、AIの活用の一側面に過ぎず、人間中心の理念そのものではありません。\ndは、AIのリスク管理の一つの考え方ですが、「人間中心」の指針が直接的に言及している内容ではありません。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 89,
    "問題文": "「共通の指針」における「安全性」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "AIシステムの開発・提供・利用を通じ、ステークホルダーの生命・身体・財産、精神、環境に危害を及ぼさないようにすべきである。",
    "選択肢b": "AIシステムの開発・提供・利用を通じ、ステークホルダーの財産にのみ危害を及ぼさないようにすべきである。",
    "選択肢c": "AIシステムがサイバー攻撃を受けないように、ネットワークの安全性を確保することのみを指す。",
    "選択肢d": "AIシステムの利用者が精神的な危害を受けないように配慮すべきだが、生命や身体への危害は対象外である。",
    "正解": "a",
    "解説": "「安全性」の指針では、AIの利用がもたらす物理的な危害（生命、身体、財産）だけでなく、メンタルヘルス（精神）や自然環境といった、より広い範囲に危害を及ぼすことがないよう求めています。\nbは、対象範囲を「財産」に限定しているため不適切です。\ncは、「セキュリティ確保」の指針に近い内容です。\ndは、対象範囲を限定しており、最も重要な「生命・身体」を対象外としているため不適切です。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 90,
    "問題文": "「共通の指針」における「公平性」に関する記述として、最も適切なものはどれか。",
    "選択肢a": "全ての利用者に対して、AIシステムが全く同じ結果を出力することを保証すべきである。",
    "選択肢b": "AIシステムが特定の属性（人種、性別など）を理由に、不当で有害な偏見や差別を生まないよう努めるべきである。",
    "選択肢c": "AIシステムからバイアスを完全に排除することは容易であるため、バイアスが残存したままのサービス提供は許されない。",
    "選択肢d": "AIの学習データに含まれる社会的な偏見は、AIの性能向上のために積極的に活用すべきである。",
    "正解": "b",
    "解説": "「公平性」の指針は、AIが社会に存在する差別や偏見を助長・再生産しないように求めるものです。開発・提供・利用の各段階で、AIの判断が特定のグループに不利益を与えないか注意を払う必要があります。\naは、文脈によっては特定の配慮が必要な場合もあり、一律に同じ結果を出すことが公平とは限りません。\ncは、AIからバイアスを完全に排除することは困難であるという認識に立ち、許容可能かどうかの評価が重要とされています。\ndは、公平性の理念とは全く逆の考え方です。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 91,
    "問題文": "「共通の指針」における「プライバシー保護」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "プライバシーは重要度に関わらず一律に、最大限のレベルで保護しなければならない。",
    "選択肢b": "関係法令を遵守するとともに、プライバシーの重要性の程度に応じて尊重し、保護することが重要である。",
    "選択肢c": "個人情報保護法で保護される個人情報のみを対象とし、それ以外のプライバシーは考慮しなくてよい。",
    "選択肢d": "利用者の利便性向上のためであれば、プライバシー保護のレベルを下げることが推奨される。",
    "正解": "b",
    "解説": "「プライバシー保護」の指針は、法令遵守を前提としつつ、全てのプライバシー情報を一律に扱うのではなく、その情報がどれだけ機微で重要かという「重要性の程度に応じて」保護レベルを判断することの重要性を指摘しています。\naは、「重要性の程度に関わらず」という点が不適切です。\ncは、法律で定義される個人情報以外の広範なプライバシーも尊重の対象となります。\ndは、利便性とプライバシーはトレードオフの関係になることがありますが、保護レベルを下げることを推奨するものではありません。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 92,
    "問題文": "「共通の指針」における「セキュリティ確保」で求められていることとして、最も適切なものはどれか。",
    "選択肢a": "AIシステムが常に正しい答えを出すように、アルゴリズムの精度を向上させること。",
    "選択肢b": "AIシステムの利用料金を、誰もが支払える範囲に設定すること。",
    "選択肢c": "AIシステムが不正な操作によって、意図しない振る舞いや停止に陥らないようにすること。",
    "選択肢d": "AIシステムの内部構造や動作原理を、全ての利用者に公開すること。",
    "正解": "c",
    "解説": "「セキュリティ確保」の指針は、AIシステム自体や、それが利用するデータやネットワークが、サイバー攻撃などによって乗っ取られたり、誤作動させられたり、停止させられたりしないように、適切な安全対策を講じることを求めています。\naは、AIの性能に関する問題であり、直接的なセキュリティとは異なります。\nbは、ビジネスモデルや価格戦略に関する問題です。\ndは、「透明性」の指針に関連する内容ですが、セキュリティ確保とは異なります。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 93,
    "問題文": "「共通の指針」における「透明性」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "AIシステムの全てのソースコードと学習データを、一般に公開することが重要である。",
    "選択肢b": "AIシステムの判断理由は人間には理解不可能であるため、説明を試みる必要はない。",
    "選択肢c": "AIシステムの検証可能性を確保し、ステークホルダーに対して合理的な範囲で情報を提供することが重要である。",
    "選択肢d": "ステークホルダーへの情報提供は不要であり、AIシステムの検証可能性を確保することのみが重要である。",
    "正解": "c",
    "解説": "「透明性」の指針は、AIシステムがどのように動作するかを後から検証できること（検証可能性）と、そのAIシステムの利用者や影響を受ける人々（ステークホルダー）に対して、判断プロセスやリスクなどを適切な範囲で説明・情報提供することの両方を求めています。\naは、企業の営業秘密などもあり、全ての情報を公開するのは現実的ではなく、そこまでは求められていません。\nbは、説明する努力を放棄しており、透明性の理念に反します。\ndは、ステークホルダーへの情報提供の重要性を否定しているため、不適切です。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 94,
    "問題文": "「共通の指針」における「アカウンタビリティ」とは、どのようなことを指すか。",
    "選択肢a": "AIシステムがもたらした結果について、開発者、提供者、利用者がそれぞれの役割に応じて合理的な範囲で説明する責任を果たすこと。",
    "選択肢b": "AIシステムを開発する際に使用する、会計（アカウンティング）処理を適切に行うこと。",
    "選択肢c": "AIシステムが常に100%の精度を達成するように、開発者が責任を持つこと。",
    "選択肢d": "AIシステムに関する全ての責任を、AIシステムの利用者が負うべきであるということ。",
    "正解": "a",
    "解説": "アカウンタビリティは、一般に「説明責任」と訳されます。AIの文脈では、AIシステムが何らかの結果（特に予期せぬ悪い結果）をもたらした場合に、なぜそうなったのかを追跡・検証し、関係者（ステークホルダー）に対して、それぞれの立場やリスクの程度に応じて説明できるようにしておくことを意味します。\nbは、言葉の混同を狙ったもので、誤りです。\ncは、100%の精度は現実的に不可能であり、アカウンタビリティの定義とは異なります。\ndは、責任を利用者のみに押し付けており、不適切です。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 95,
    "問題文": "「共通の指針」における「教育・リテラシー」で、教育を行うことが期待される対象として最も適切なものはどれか。",
    "選択肢a": "AIを開発・提供する組織の内部関係者のみ。",
    "選択肢b": "AIを利用する可能性のある顧客や社会の人々（ステークホルダー）のみ。",
    "選択肢c": "組織内部の関係者と、AIの利用者を含むステークホルダーの両方。",
    "選択肢d": "主に義務教育課程にある児童・生徒のみ。",
    "正解": "c",
    "解説": "「教育・リテラシー」の指針では、AIに直接関わる開発者や提供者が正しい知識や倫理観を持つための「内部向けの教育」と、AIの利用者や社会全体がAIの特性やリスク（誤情報など）を理解して適切に付き合えるようにするための「ステークホルダー向けの教育」の両方が期待されています。\n1とbは、対象を片方に限定しており、不適切です。\ndは、対象を限定しすぎており、不適切です。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 96,
    "問題文": "「共通の指針」における「公正競争確保」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "AI開発において競争が過熱しないよう、企業間で開発速度を調整することが期待される。",
    "選択肢b": "特定の企業がAI技術を独占し、市場を支配することを推奨することが期待される。",
    "選択肢c": "AI分野で健全な競争が行われ、新たなビジネスや社会課題の解決策が生まれる環境の維持に努めることが期待される。",
    "選択肢d": "全てのAI技術はオープンソースとして公開し、競争そのものをなくすことが期待される。",
    "正解": "c",
    "解説": "「公正競争確保」の指針は、AI市場が一部の大企業に独占されたり、不公正な取引が行われたりすることなく、多くのプレイヤーが参加して自由に競争できる環境を維持することの重要性を指摘しています。これにより、技術革新が進み、社会全体が利益を得られるとしています。\na、b、dは、公正な競争を阻害したり、なくしたりする方向性であり、ガイドラインの趣旨とは異なります。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 97,
    "問題文": "「共通の指針」における「イノベーション」に関する説明として、最も適切なものはどれか。",
    "選択肢a": "リスクを避けるため、既存の技術の範囲内でAIを開発し、革新的な挑戦は控えるべきである。",
    "選択肢b": "自社の利益のみを追求し、技術やデータを独占することでイノベーションを主導すべきである。",
    "選択肢c": "AIの研究開発や社会実装を通じて、社会全体のイノベーションの促進に貢献するよう努めるべきである。",
    "選択肢d": "イノベーションは主に研究機関の役割であり、民間事業者はその成果を利用することに専念すべきである。",
    "正解": "c",
    "解説": "「イノベーション」の指針は、AI事業者に対して、単に自社の利益を追求するだけでなく、AI技術の発展とその社会実装を通じて、社会全体の課題解決や新しい価値の創造（イノベーション）に貢献していくという、より広い視点を持つことを期待するものです。\naは、イノベーションとは逆の姿勢です。\nbは、社会全体の利益という視点が欠けています。\ndは、事業者にもイノベーションへの貢献を期待するものであり、役割を限定していません。",
    "ジャンル": "AI理念・ガイドライン"
  },
  {
    "id": 98,
    "問題文": "LLM（大規模言語モデル）に関する説明として、最も適切なものはどれか。",
    "選択肢a": "LM（言語モデル）と比較して、より小規模なデータセットで特定のタスクに特化してトレーニングされたモデルである。",
    "選択肢b": "LM（言語モデル）と比較して、非常に大規模なデータセットでトレーニングされた汎用的な自然言語処理モデルである。",
    "選択肢c": "画像生成や音声認識を専門とするAIモデルの総称である。",
    "選択肢d": "LM（言語モデル）とLLMは、全く同じものを指す同義語である。",
    "正解": "b",
    "解説": "LLM（Large Language Model）は、その名の通り、従来のLM（Language Model）よりも桁違いに大規模なテキストデータセットを用いてトレーニングされたモデルです。これにより、特定のタスクに限定されない、非常に高い汎用性と精度を実現しています。\naは、説明が逆です。LLMは大規模なデータで学習します。\ncは、LLMは主に自然言語（テキスト）を扱うモデルです。\ndは、LLMはLMの一種ですが、その規模において区別されるため、同義語ではありません。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 99,
    "問題文": "LLMが高い精度を実現するために用いられる、2段階のトレーニング手法の組み合わせとして、最も適切なものはどれか。",
    "選択肢a": "教師あり学習と教師なし学習",
    "選択肢b": "プレトレーニングとファインチューニング",
    "選択肢c": "バッチ学習とオンライン学習",
    "選択肢d": "Zero-ShotとFew-Shot",
    "正解": "b",
    "解説": "LLMのトレーニングは、まず「プレトレーニング（事前学習）」で大規模なデータから言語の一般的な知識を幅広く学習し、その後「ファインチューニング（微調整）」で特定のタスクや目的に合わせたデータで専門的な知識を学習させる、という2段階で行われるのが一般的です。\naは、機械学習の分類であり、LLMのトレーニング段階を直接指すものではありません。\ncは、学習データの与え方の違いによる分類です。\ndは、LLMに入力するプロンプトの種類の名称です。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 100,
    "問題文": "LLMの出力の多様性（ランダムさ）を制御する「Temperature」や「Top-p」といったパラメータに関する記述として、最も適切なものはどれか。",
    "選択肢a": "これらのパラメータはモデルの性能に影響を与えず、主に出力の速さを調整するためにある。",
    "選択肢b": "これらのパラメータは一度設定すると、全ての利用者が同じ設定で使うことになる。",
    "選択肢c": "これらのパラメータはAIが自動で最適化するため、利用者が手動で設定することはできない。",
    "選択肢d": "これらのパラメータの値は調整可能で、使用するLLMのバージョンや設定によって出力結果が変わる可能性がある。",
    "正解": "d",
    "解説": "TemperatureやTop-pは、LLMが次に来る単語を予測する際の確率分布を調整するためのパラメータです。これらの値を変更することで、より決まりきった文章を生成させたり、逆により創造的で多様な文章を生成させたりすることができます。設定値はAPIなどを通じて調整可能であり、その挙動はモデルによって異なる場合があります。\naは、出力内容に直接影響を与えるため、誤りです。\n2とcは、これらのパラメータは利用者が意図に応じて調整できるのが一般的であり、誤りです。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 101,
    "問題文": "LLMのトレーニングにおける「プレトレーニング（事前学習）」段階で一般的に用いられる学習手法はどれか。",
    "選択肢a": "教師あり学習",
    "選択肢b": "教師なし学習",
    "選択肢c": "強化学習",
    "選択肢d": "半教師あり学習",
    "正解": "b",
    "解説": "プレトレーニングでは、インターネット上のテキストなど、人間が正解ラベルを付けていない膨大な量のデータを使用します。AIは、文章の穴埋め問題（単語の予測）などを自ら解くことを通じて、言語の文法や単語間の関係性といったパターンを自律的に学習します。これは「教師なし学習」に分類されます。\naは、正解ラベル付きのデータを用いる手法です。\ncは、行動と報酬によって学習する手法です。\ndは、ラベル付きとラベルなしの両方のデータを用いる手法です。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 102,
    "問題文": "LLMのトレーニングにおける「ファインチューニング（微調整）」の目的として、最も適切なものはどれか。",
    "選択肢a": "一般的な言語知識を獲得するために、インターネット全体のテキストを学習させること。",
    "選択肢b": "特定のタスク（医療、法律など）や特定の文脈に合わせて、モデルの知識や応答スタイルを調整すること。",
    "選択肢c": "モデルのパラメータ数を削減し、計算コストを下げること。",
    "選択肢d": "モデルからバイアスや不適切な知識を完全に除去すること。",
    "正解": "b",
    "解説": "ファインチューニングは、事前学習で汎用的な能力を身につけたLLMに対して、より専門的なデータセットや対話データなどを追加で学習させ、特定のタスクの性能を向上させたり、望ましい応答をするように「しつけ」たりするプロセスです。\naは、プレトレーニングの目的です。\n3とdは、ファインチューニングの結果として得られる可能性はありますが、その主目的ではありません。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 103,
    "問題文": "モデルの学習が始まる前に人間が手動で設定し、モデルの構造や学習の進め方を制御するパラメータを何と呼ぶか。",
    "選択肢a": "重み（Weight）",
    "選択肢b": "バイアス（Bias）",
    "選択肢c": "ハイパーパラメータ",
    "選択肢d": "変数（Variable）",
    "正解": "c",
    "解説": "ハイパーパラメータは、学習率や層の数、Temperatureなど、モデルの学習プロセスそのものを規定する「設定値」です。モデルの性能を最大限に引き出すためには、このハイパーパラメータを適切に調整する作業（チューニング）が非常に重要になります。\n1とbは、モデルが学習の過程でデータから自動的に調整していくパラメータです。\ndは、プログラミングにおける一般的な用語であり、この文脈では不適切です。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 104,
    "問題文": "LLMへのプロンプトで出力の質を高める4つの要素は、「命令」「入力データ」「出力指示」と、あと一つは何か。",
    "選択肢a": "文脈（Context）",
    "選択肢b": "パラメータ（Parameter）",
    "選択肢c": "モデル名（Model Name）",
    "選択肢d": "文字数（Character Count）",
    "正解": "a",
    "解説": "優れたプロンプトを構成する要素は、①命令（何をしてほしいか）、②文脈（背景情報や制約条件）、③入力データ（処理対象のテキストなど）、④出力指示（出力の形式やスタイル）の4つとされています。特に「文脈」を与えることで、AIはより状況に適した回答を生成しやすくなります。\nb、c、dは、プロンプトに含めることもありますが、基本の4要素には含まれません。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 105,
    "問題文": "LLMへのプロンプトにおいて、具体的な回答例を2〜3個提示してから質問を入力することで、回答の精度や形式を誘導する手法を何と呼ぶか。",
    "選択肢a": "Few-Shot プロンプティング",
    "選択肢b": "Zero-Shot プロンプティング",
    "選択肢c": "Chain-of-Thought プロンプティング",
    "選択肢d": "ReAct プロンプティング",
    "正解": "a",
    "解説": "Few-Shot プロンプティングは、いくつかの（Few）手本（Shot）をAIに見せることで、どのような回答を期待しているかを具体的に伝え、望ましい出力を得やすくする手法です。\nbは、手本を一切与えずに質問だけをする最もシンプルな手法です。\ncは、思考のプロセスを段階的に記述させることで、複雑な問題の正答率を上げる手法です。\ndは、思考と行動を組み合わせることで、より高度なタスクを実行させる手法です。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 106,
    "問題文": "LLMへのプロンプトにおいて、具体的な例文を一切与えずに、聞きたい質問だけを単独で入力する最もシンプルな手法を何と呼ぶか。",
    "選択肢a": "Few-Shot プロンプティング",
    "選択肢b": "One-Shot プロンプティング",
    "選択肢c": "Multi-Shot プロンプティング",
    "選択肢d": "Zero-Shot プロンプティング",
    "正解": "d",
    "解説": "Zero-Shot プロンプティングは、手本（Shot）がゼロ（Zero）の状態で質問を投げかける方法です。LLMが持つ汎用的な知識だけで回答を生成させるため、最も手軽ですが、複雑な指示には向かない場合があります。\naは、手本を2〜3個与える手法です。\nbは、手本を1個だけ与える手法です。\ncは、Few-Shotの別名として使われることがありますが、一般的ではありません。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 107,
    "問題文": "「Zero-Shot プロンプティング」と「Few-Shot プロンプティング」の使い分けに関する記述として、最も適切なものはどれか。",
    "選択肢a": "簡単な質問や一般的な知識を問う場合は、手軽なZero-Shotが適している。",
    "選択肢b": "特定のフォーマットで回答してほしい場合は、指示が曖昧になるZero-Shotが適している。",
    "選択肢c": "複雑な質問や創造的な回答を求める場合は、シンプルなFew-Shotが適している。",
    "選択肢d": "どちらの手法も性能は変わらないため、好みで使い分ければよい。",
    "正解": "a",
    "解説": "Zero-Shot プロンプティングは、手本を用意する手間がなく、簡単かつ迅速に回答を得たい場合に適しています。一方、Few-Shot プロンプティングは、手本を示すことでAIの思考を誘導し、より複雑で質の高い回答を引き出したい場合に有効です。\nbは、特定のフォーマットを指示したい場合は、その手本を示すFew-Shotの方が適しています。\ncは、複雑なタスクにはFew-Shotの方が適しています。\ndは、一般的にFew-Shotの方がZero-Shotよりも高品質な出力を得やすいとされており、明確な使い分けが存在します。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 108,
    "問題文": "テキスト生成AIの出力の信頼性に関する記述として、最も適切なものはどれか。",
    "選択肢a": "AIは客観的な事実のみを学習するため、出力が不正確になることはない。",
    "選択肢b": "AIはトレーニングデータの偏りや不完全さの影響を受け、不正確な情報を生成することがある。",
    "選択肢c": "AIは人間の感情やニュアンスを完全に理解できるため、誤解や誤訳は生じない。",
    "選択肢d": "最新のAIは、学習データに存在しない未知の出来事についても正確に予測できる。",
    "正解": "b",
    "解説": "テキスト生成AIの知識や性能は、その学習データに大きく依存します。したがって、学習データに偏見が含まれていれば偏った内容を、古い情報が多ければ古い内容を、誤りが含まれていれば誤った内容を出力する可能性があります。\n1とcは、AIの能力を過大評価しており、誤りです。AIは事実でない情報も学習しますし、ニュアンスの完全な理解は困難です。\ndは、AIは学習データに基づいて確率的な予測を行うものであり、未来予知のようなことはできません。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 109,
    "問題文": "テキスト生成AIによる文章からのタスク抽出能力に関する記述として、最も適切なものはどれか。",
    "選択肢a": "文章からタスクを抽出することはできるが、全てのタスクを漏れなく完璧に抽出できるとは限らない。",
    "選択肢b": "AIは文章の要点を完璧に理解するため、人間が見逃すようなタスクも100%抽出できる。",
    "選択肢c": "タスク抽出はAIが最も苦手とする分野であり、実用的なレベルには達していない。",
    "選択肢d": "短いメモからはタスクを抽出できるが、長いメールからは抽出できない。",
    "正解": "a",
    "解説": "テキスト生成AIは、会議の議事録やメールの文面から「誰が」「いつまでに」「何をするか」といったタスクを抽出するのに非常に役立ちます。しかし、AIの解釈ミスや、文章自体の曖昧さによって、タスクを誤って抽出したり、一部を見逃したりする可能性は常にあります。\nbは、「100%」や「完璧」といった断定的な表現が不適切です。最終的な確認は人間が行うべきです。\ncは、現状の認識とは異なります。タスク抽出はAIの得意な応用例の一つです。\ndは、文章の長さに絶対的な制約があるわけではありません。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 110,
    "問題文": "GPT-3.5などのテキスト生成AIの制約に関する記述として、一般的に言われていることはどれか。",
    "選択肢a": "複雑な計算や論理的推論は得意だが、文章の要約は不得意である。",
    "選択肢b": "指定された文字数や単語数に合わせて、正確に文章量を調整することが得意である。",
    "選択肢c": "感性やユーモアの理解は不得意だが、事実に基づいた客観的な文章の生成は常に正確である。",
    "選択肢d": "指定された文字数で文章を生成するよう指示しても、結果が大きくずれることがあり、文字数調整は不得意である。",
    "正解": "d",
    "解説": "多くのLLMは、単語を順番に生成していく仕組み上、「全体で〇〇文字になるように」といった厳密な文字数制御を苦手とする傾向があります。そのため、「〇〇文字程度で」と指示しても、大幅に長くなったり短くなったりすることがあります。\naは、逆です。要約は得意ですが、複雑な計算は間違えることがあります。\nbは、逆です。文字数調整は不得意とされています。\ncは、事実に基づかない情報（ハルシネーション）を生成することがあるため、常に正確とは言えません。",
    "ジャンル": "生成AIプロンプト"
  },
  {
    "id": 111,
    "問題文": "AIが不得意とされるタスクに関する記述として、最も適切なものはどれか。",
    "選択肢a": "データに基づいた客観的な分析は得意だが、人間の感性や文化的背景を深く理解する必要がある芸術批評などは不得意である。",
    "選択肢b": "大量の文章を要約することは不得意だが、短い詩を創作することは得意である。",
    "選択肢c": "AIは独自の感情を持つため、人間以上に共感的なカウンセリングを行うことができる。",
    "選択肢d": "芸術作品の制作年や作者といった factual な情報の検索は、AIにはできない。",
    "正解": "a",
    "解説": "芸術批評には、作品の技術的な側面だけでなく、それが作られた時代の文化や歴史、人々の感情にどう訴えかけるか、といった多角的な解釈が求められます。AIは、このような人間独自の経験や感性、価値観に基づく評価を行うことはできません。\nbは、逆です。要約は得意ですが、人間のように心に響く詩を創作するのは非常に困難です。\ncは、AIは感情を持たず、過去の対話データからそれらしい応答を生成しているにすぎません。\ndは、そのような事実情報の検索はAIの得意なタスクの一つです。",
    "ジャンル": "生成AIプロンプト"
  }
]